{
  "vendors": [
    {
      "vendorid": "V01",
      "name": "Advanced Exercise"
    },
    {
      "vendorid": "V02",
      "name": "Marathon Fitness"
    },
    {
      "vendorid": "V03",
      "name": "Risher Fitness"
    },
    {
      "vendorid": "V04",
      "name": "Technogym"
    },
    {
      "vendorid": "V05",
      "name": "Top Fitness"
    }
  ],
  "equipment": [
    {
      "equipmentid": "E01",
      "name": "Dual Pulley"
    },
    {
      "equipmentid": "E02",
      "name": "Leg Ext/Curl"
    },
    {
      "equipmentid": "E03",
      "name": "Chest Press"
    },
    {
      "equipmentid": "E04",
      "name": "Treadmill"
    },
    {
      "equipmentid": "E05",
      "name": "Elliptical"
    },
    {
      "equipmentid": "E06",
      "name": "Recumbent Bike"
    },
    {
      "equipmentid": "E07",
      "name": "Rower"
    },
    {
      "equipmentid": "E08",
      "name": "Bench"
    }
  ],
  "brands": [
    {
      "brandid": "B01",
      "name": "Concept2"
    },
    {
      "brandid": "B02",
      "name": "Life Fitness"
    },
    {
      "brandid": "B03",
      "name": "Matrix"
    },
    {
      "brandid": "B04",
      "name": "Precor"
    },
    {
      "brandid": "B05",
      "name": "Technogym"
    },
    {
      "brandid": "B06",
      "name": "True"
    },
    {
      "brandid": "B07",
      "name": "Xebex"
    }
  ],
  "products": [
    {
      "vendorid": "V01",
      "equipmentid": "E01",
      "brandid": "B02",
      "vendor": "Advanced Exercise",
      "equipment": "Dual Pulley",
      "brand": "Life Fitness",
      "model": "Axiom Dual Adjsutable Pulley",
      "qty": 1,
      "baseUnitPrice": 4761.6,
      "allInUnitPrice": 6215.943248541054,
      "overallScore": 8.360570172006279,
      "url": "https://www.lifefitness.com/en-us/catalog/strength-training/storage-racks/life-fitness-dual-adjustable-puley-4-1",
      "S01": 8.5,
      "S02": 8.375,
      "S03": 8.507712268864276,
      "S04": 8.25,
      "S05": 8,
      "S06": 8.75,
      "S07": 8.5,
      "S08": 10,
      "S09": 6.333333333333333,
      "S10": 8.290641742599036,
      "S11": 7.094594594594595,
      "S12": 8.360570172006279,
      "C02": 3068.5200000000004,
      "C03": 630,
      "C04": "Light-commercial welded steel frame with standard powder-coat finish. Pulley housings are stable during movement and cable action is smooth. Frame geometry is simpler and less sculpted than Signature or Insignia lines, but construction is appropriate for hotels, multi-unit housing gyms, and corporate fitness rooms. Overall refinement exceeds Matrix Versa but is below Technogym’s premium finish.\n(LifeFitness-Axiom-ProductPage; LifeFitness-Commercial-Brochure; Commercial-Dealer-Axiom-Listings)",
      "C05": 165,
      "C06": "10/5/0.25",
      "C07": "Durable in light-commercial settings with moderate daily use. Cable, pulley, and guide rod components require periodic maintenance but generally show consistent long-term performance. Frame and stack assemblies hold up well in hospitality, residential, and corporate installations, though the unit is not built for continuous heavy club traffic.\n(Commercial-Hotel-Gym-Dealer-Listings; Refurbished-Axiom-CableStations; Apartment-Gym-Installer-Reviews)",
      "C08": "Reliable in multi-user environments with predictable wear patterns. Refurbishers note that Axiom cable units remain mechanically stable through multiple ownership cycles when maintained properly. Not as overbuilt as Signature, but reliability is strong for light-commercial applications.\n(Commercial-Refurbishers-Axiom-Listings; Hotel-Fitness-Installer-Feedback; Fitness-Equipment-Technician-Reports)",
      "C09": "Straightforward adjustment mechanisms with clear markings and a standard 2:1 ratio. Levers and selector points are easy to access. Instructional placard is adequate, though less detailed than higher-tier Life Fitness lines. Movement range is suitable for general fitness users.\n(LifeFitness-Axiom-ProductPage; Dealer-Axiom-DAP-Listings)",
      "C10": "Large U.S. service network with extensive parts availability. Technicians commonly carry Life Fitness components, and maintenance is straightforward. Faster service access than European brands in most U.S. metro areas.\n(LifeFitness-US-Service-Locator; Commercial-Fitness-Technician-Reviews)",
      "C11": "Clean, functional design with simple frame geometry and minimal shrouding. Blends well in multi-unit housing gyms but lacks premium sculpting found in higher-tier Life Fitness or Technogym lines.\n(LifeFitness-Axiom-Photos; Commercial-Apartment-Gym-Installations)",
      "C14": "2:1 ratio",
      "C15": "56.2 x 54.6 x 84"
    },
    {
      "vendorid": "V01",
      "equipmentid": "E02",
      "brandid": "B02",
      "vendor": "Advanced Exercise",
      "equipment": "Leg Ext/Curl",
      "brand": "Life Fitness",
      "model": "Axiom Series Seated Leg Curl/Extension",
      "qty": 1,
      "baseUnitPrice": 4410.4,
      "allInUnitPrice": 5477.084450520959,
      "overallScore": 8.387235250743787,
      "url": "https://www.lifefitness.com/en-us/catalog/strength-training/selectorized/axiom-series-leg-extension-leg-curl",
      "S01": 8.5,
      "S02": 8.27787456445993,
      "S03": 8.05379622688869,
      "S04": 8.25,
      "S05": 9,
      "S06": 8.75,
      "S07": 8.5,
      "S08": 9.5,
      "S09": 6.333333333333333,
      "S10": 7.826086956521739,
      "S11": 9.390625,
      "S12": 8.387235250743787,
      "C02": 3220,
      "C03": 601,
      "C04": "Light-commercial welded steel construction with refined pad contours and smooth movement arms. Seat and pad upholstery quality exceeds Matrix and Precor in this segment, though finish is simpler than Life Fitness Signature. Cable routing and arm pivot points are well engineered for consistent movement.\n(LifeFitness-Axiom-ProductPage; Commercial-Dealer-Axiom-Listings)",
      "C05": 202.5,
      "C06": "10/5/0.25",
      "C07": "Performs reliably in hospitality and multi-unit housing gyms. Pads, upholstery, and pivot points maintain integrity over long-term moderate use. Not intended for high-volume health club environments but well suited for condominium and hotel applications.\n(Hotel-Fitness-Installer-Notes; Refurbisher-Axiom-LegMachines)",
      "C08": "Selectorized system has stable, predictable operation; users report smooth transitions and minimal mechanical issues. Routine replacement of cables/pads expected at multi-year intervals. Long-term reliability is strong for the light-commercial tier.\n(Technician-Reports; Commercial-Distributor-Feedback)",
      "C09": "Intuitive adjustments with clearly marked levers. Switching between leg extension and curl is straightforward. Seat and pad ergonomics accommodate a wide range of users, including older adults. Offers a comfortable motion path with less setup complexity than Matrix duals.\n(LifeFitness-Axiom-User-Guides)",
      "C10": "Life Fitness maintains one of the strongest U.S. service networks. Parts—particularly pads, cables, and bearings—are readily available, and repair technicians commonly carry compatible components.\n(LifeFitness-US-Service-Locator)",
      "C11": "Clean, contemporary design with molded pads and subtle branding. More refined than Precor or Matrix in this segment, but below the sculpted, premium appearance of Technogym.\n(Axiom-Commercial-Installations)",
      "C14": "1:1 selectorized",
      "C15": "70 x 46 x 53"
    },
    {
      "vendorid": "V01",
      "equipmentid": "E03",
      "brandid": "B02",
      "vendor": "Advanced Exercise",
      "equipment": "Chest Press",
      "brand": "Life Fitness",
      "model": "Axiom Chest Press",
      "qty": 1,
      "baseUnitPrice": 4410.4,
      "allInUnitPrice": 5477.084450520959,
      "overallScore": 8.051646760527841,
      "url": "https://www.lifefitness.com/en-us/catalog/strength-training/selectorized/axiom-series-chest-press",
      "S01": 8,
      "S02": 8.96875,
      "S03": 6.912131287052199,
      "S04": 8.25,
      "S05": 8,
      "S06": 8,
      "S07": 8,
      "S08": 10,
      "S09": 6.333333333333333,
      "S10": 9.037433155080214,
      "S11": 2.8027681660899657,
      "S12": 8.051646760527841,
      "C02": 2244,
      "C03": 162,
      "C04": "Light-commercial welded steel frame with a refined movement arm and well-contoured pads. The press motion feels smooth and controlled, with good alignment through the range of motion. Upholstery and finishing details are a step up from basic commercial lines, though less premium than Life Fitness Signature. Overall build quality is strong and well suited to multi-unit housing, corporate, and hospitality gyms.",
      "C05": 202.5,
      "C06": "10/5/0.25",
      "C07": "Designed for moderate daily use in light-commercial environments. Frame, pivot points, and guide rods hold up well over time, with expected wear primarily in pads, grips, and cables. Facilities that follow standard maintenance schedules typically see long service lives without major structural issues. Durability is very good for its intended usage tier.",
      "C08": "Axiom selectorized units have a solid reputation for predictable, low-drama operation. Mechanical issues are usually limited to routine cable or upholstery replacement, with few reports of chronic failures in linkage or stack assemblies. The machine maintains smooth performance across multiple users and ownership cycles when serviced on a regular schedule. Overall reliability is strong for HOA and hospitality settings.",
      "C09": "Seat and back adjustments are intuitive, with brightly marked levers that are easy to reach from the seated position. The press path is natural and forgiving, with ergonomics that accommodate a broad range of chest and shoulder mobility, including older adults. Handles provide a comfortable grip and clear start/finish positions, making the machine easy for first-time users. Setup is quick and requires very little instruction.",
      "C10": "Life Fitness offers one of the most extensive commercial service and parts networks in the U.S. Common items such as pads, grips, cables, and bearings are widely stocked, and technicians are very familiar with Axiom series equipment. This typically translates into shorter downtimes and straightforward repairs. Support infrastructure is a key advantage for this brand.",
      "C11": "Clean, contemporary styling with subtle curves and well-finished upholstery. The Axiom chest press looks more refined than many mid-tier commercial pieces, though not as striking as Technogym’s flagship designs. It presents well in condo, hotel, and corporate environments where a modern but not overly flashy appearance is desired. Overall, it gives the room a polished, professional look.",
      "C14": "1:1 selectorized",
      "C15": "44 x 51 x 53"
    },
    {
      "vendorid": "V01",
      "equipmentid": "E04",
      "brandid": "B02",
      "vendor": "Advanced Exercise",
      "equipment": "Treadmill",
      "brand": "Life Fitness",
      "model": "Aspire SL Console",
      "qty": 2,
      "baseUnitPrice": 6024.85,
      "allInUnitPrice": 6880.907467070282,
      "overallScore": 8.281348990208325,
      "url": "https://www.lifefitness.com/en-us/catalog/cardio/treadmills/aspire",
      "S01": 9,
      "S02": 7.75,
      "S03": 6.735321905441292,
      "S04": 8.25,
      "S05": 8,
      "S06": 9,
      "S07": 8.75,
      "S08": 9.5,
      "S09": 8.4,
      "S10": 8.263473053892215,
      "S11": 9.493670886075948,
      "S12": 8.281348990208325,
      "C02": 3006,
      "C03": 375,
      "C04": "Light-commercial welded steel frame with a refined deck structure and high-quality belt and roller components. FlexDeck® shock absorption provides smooth cushioning superior to Precor and Matrix in this segment. Overall build is strong but the Aspire line is positioned below Integrity and Elevation series.\n(Sources: LifeFitness-Aspire-ProductPage; Commercial-Dealer-Notes)",
      "C05": 10,
      "C06": "7/3/3",
      "C07": "Performs consistently in moderate-traffic environments such as condominiums, hotels, and corporate fitness rooms. Deck and belt materials withstand long-term use with predictable wear intervals. Not intended for continuous heavy club traffic but excellent for HOA and hospitality settings.\n(Sources: LifeFitness-Commercial-Sales-Materials; Installer-Feedback)",
      "C08": "Life Fitness treadmills have a strong reputation for reliable electronics and stable performance. Aspire units maintain consistent operation with low incidence of lift motor or control board failures. Reliability is high for the light-commercial tier.\n(Sources: Technician-Reports; Fitness-Equipment-Refurbisher-Comments)",
      "C09": "The SL console is simple and intuitive, with clear controls, responsive keys, and a familiar Life Fitness layout. Step-up height is moderate at 10\". Console is easy for older and first-time users.\n(Sources: LifeFitness-Aspire-User-Guides)",
      "C10": "Life Fitness maintains one of the strongest commercial service networks in the U.S. Parts—including belts, rollers, decks, and electronics—are widely stocked and easily sourced.\n(Sources: LifeFitness-US-Service-Locator)",
      "C11": "Modern and visually appealing design with cleaner lines than Precor or Matrix at this level. Not as sculpted or premium as Technogym, but looks polished and contemporary in multi-unit gyms.\n(Sources: Commercial-Installations; LifeFitness-Aspire-Photos)",
      "C14": 400,
      "C15": "83.5 x 36 x 58"
    },
    {
      "vendorid": "V01",
      "equipmentid": "E05",
      "brandid": "B02",
      "vendor": "Advanced Exercise",
      "equipment": "Elliptical",
      "brand": "Life Fitness",
      "model": "Aspire SL Console",
      "qty": 2,
      "baseUnitPrice": 4685.85,
      "allInUnitPrice": 5404.8276119591455,
      "overallScore": 8.362950741950833,
      "url": "https://www.lifefitness.com/en-us/catalog/cardio/ellipticals/aspire-elliptical-machine",
      "S01": 8.5,
      "S02": 8.710526315789473,
      "S03": 7.9739133024172375,
      "S04": 8.25,
      "S05": 8.5,
      "S06": 9,
      "S07": 8.5,
      "S08": 9,
      "S09": 6.4,
      "S10": 7.992863514719001,
      "S11": 6.696428571428571,
      "S12": 8.362950741950833,
      "C02": 2522.25,
      "C03": 225,
      "C04": "Light-commercial welded frame with refined mechanical action and smooth pedal articulation. Cushioned pedals and ergonomic handlebars are more sculpted and comfortable than Precor or Matrix. Positioned below the Integrity and Elevation lines but maintains Life Fitness’s reputation for excellent movement quality.\n(Sources: LifeFitness-Aspire-ProductPage; Dealer-Aspire-Notes)",
      "C05": 9.5,
      "C06": "7/3/1",
      "C07": "Performs reliably in hotels, apartment gyms, and corporate fitness rooms. Bearings and pedal linkages hold up well under regular use. Wear components follow predictable replacement intervals.\n(Sources: Commercial-Installer-Feedback; LifeFitness-Commercial-Sales-Materials)",
      "C08": "Consistent mechanical and electronic performance. Control boards and drive systems show low failure rates in light-commercial settings. Considered dependable and low-maintenance.\n(Sources: Technician-Reports; Fitness-Equipment-Refurbisher-Comments)",
      "C09": "Step-up height of 9.5” is moderate. Console is highly intuitive with familiar Life Fitness layout, clear controls, and responsive quick keys. Suitable for all user levels including older adults.\n(Sources: LifeFitness-Aspire-User-Guides)",
      "C10": "Life Fitness maintains the strongest technician and parts network in the U.S. Replacement pedals, bearings, and electronics are widely stocked, minimizing downtime.\n(Sources: LifeFitness-US-Service-Locator; Commercial-Technician-Reviews)",
      "C11": "Modern, refined look with clean lines and visually appealing pedal and handlebar design. More premium appearance than Precor or Matrix, but not as striking as Technogym.\n(Sources: LifeFitness-Aspire-Photos; Commercial-Installations)",
      "C14": 20,
      "C15": "85.5 x 29.5 x 64"
    },
    {
      "vendorid": "V01",
      "equipmentid": "E06",
      "brandid": "B02",
      "vendor": "Advanced Exercise",
      "equipment": "Recumbent Bike",
      "brand": "Life Fitness",
      "model": "Aspire SL Console",
      "qty": 1,
      "baseUnitPrice": 3079.05,
      "allInUnitPrice": 3702.5352916798715,
      "overallScore": 8.448923956408375,
      "url": "https://www.lifefitness.com/en-us/catalog/cardio/bikes-indoor-cycles/aspire-lifecycle-recumbent-exercise-bike",
      "S01": 8.5,
      "S02": 9.25,
      "S03": 8.247825928355276,
      "S04": 8.25,
      "S05": 9,
      "S06": 9,
      "S07": 8.5,
      "S08": 9.5,
      "S09": 6.4,
      "S10": 5.1836969001148105,
      "S11": 10,
      "S12": 8.448923956408375,
      "C02": 1742,
      "C03": 211,
      "C04": "Light-commercial welded steel frame with a smooth, well-aligned seat rail and refined pedal crank assembly. Seat and backrest sculpting are more comfortable and ergonomic than Precor and Matrix at this tier. Mechanical action is fluid, supported by high-quality bearings and belt components. While positioned below the Integrity and Elevation lines, the Aspire recumbent retains Life Fitness’s reputation for polished, durable movement mechanics.\n(Sources: LifeFitness-Aspire-ProductPage; Commercial-Dealer-Notes; Hotel-Fitness-Equipment-Reviews)",
      "C05": "Wide, unobstructed step-through design with low standover height and supportive side handles. Seat adjustments travel smoothly and allow users of varying mobility levels to enter without lifting legs over frame tubing. The layout is particularly well-suited for older adults or deconditioned users commonly found in condominium and hospitality environments.\n(Sources: LifeFitness-Aspire-User-Guides; Senior-Fitness-Operator-Feedback)",
      "C06": "7/3/1",
      "C07": "Performs reliably in apartment gyms, hotels, and corporate fitness centers. Seat rails, pedal assemblies, and belt components maintain consistent function over long-term moderate use. Pads and upholstery exhibit slow wear, and overall structural durability is strong for a light-commercial recumbent. Not designed for heavy club traffic but well-suited for HOA and hospitality demands.\n(Sources: Commercial-Installer-Feedback; LifeFitness-Commercial-Sales-Materials; Refurbisher-Aspire-Reports)",
      "C08": "Electronics and control systems are stable with low rates of failure in light-commercial settings. Pedal mechanics and seat adjustments remain reliable, and issues are generally limited to routine wear components. Typically rated as dependable and low-maintenance for multi-user environments.\n(Sources: Technician-Reports; Fitness-Equipment-Refurbisher-Comments; Dealer-Service-Logs)",
      "C09": "Console layout is clear and intuitive, with responsive buttons and well-organized program navigation. Step-through design enhances accessibility, and seat adjustments accommodate a wide population including seniors. Pedal straps and handlebars are straightforward to reach and modify.\n(Sources: LifeFitness-Aspire-User-Guides; Hospitality-Fitness-Operator-Feedback)",
      "C10": "Life Fitness has the densest parts and technician support network in the U.S. Replacement pads, pedals, bearings, belts, and electronics are widely stocked by commercial service providers. Downtime is generally minimal due to strong domestic parts availability.\n(Sources: LifeFitness-US-Service-Locator; Commercial-Technician-Reviews; Dealer-Repair-Data)",
      "C11": "Refined and modern appearance with clean lines and sculpted seat/backrest contours. More visually appealing than Precor or Matrix at this level, though not as striking or premium as Technogym. Fits well in condominium and hospitality settings seeking a polished look without premium pricing.\n(Sources: LifeFitness-Aspire-Photos; Commercial-Installations)",
      "C14": 400,
      "C15": "67 x 26 x 51.5"
    },
    {
      "vendorid": "V01",
      "equipmentid": "E07",
      "brandid": "B02",
      "vendor": "Advanced Exercise",
      "equipment": "Rower",
      "brand": "Life Fitness",
      "model": "Heat Row",
      "qty": 1,
      "baseUnitPrice": 2495.2,
      "allInUnitPrice": 3161.7253158049602,
      "overallScore": 7.90090729409808,
      "url": "https://www.lifefitness.com/en-us/catalog/cardio/rowers/heat-row",
      "S01": 8.5,
      "S02": 9,
      "S03": 4.065917460154405,
      "S04": 8.25,
      "S05": 9,
      "S06": 9,
      "S07": 8.5,
      "S08": 9,
      "S09": 5.523809523809524,
      "S10": 6.336134453781512,
      "S11": 10,
      "S12": 7.90090729409808,
      "C02": 2380,
      "C03": 134,
      "C04": "High-end welded frame with a robust drive system, premium footboards, and a refined rail assembly. Movement mechanics are smooth and consistent, benefiting from Life Fitness engineering used across their commercial cardio lines. Build quality is noticeably more polished than Precor/Xebex and competitive with Technogym Skillrow.\n(Sources: LifeFitness-HeatRow-ProductPage; Commercial-Dealer-Notes; Boutique-Studio-Reviews)",
      "C05": "Seat height is moderate at 17.7 inches, easier to mount than low-profile rowers like Concept2. The frame provides a clear walk-around zone but lacks side assist handles. Front housing is compact, reducing forward lean. For seniors and deconditioned users, accessibility is above average, though not as easy as elevated Concept2 competitors.\n(Sources: LifeFitness-HeatRow-UserGuide; Senior-Fitness-Operator-Feedback)",
      "C06": "3/2/1",
      "C07": "Engineered for moderate to high commercial use. Belt, drive fan, and footboard assemblies hold up very well, with predictable wear cycles. Many units in boutique studios and corporate facilities remain operational with minimal intervention. Structural and mechanical durability exceed Precor/Xebex but fall slightly below Concept2’s longstanding reputation.\n(Sources: Commercial-Installer-Feedback; Refurbisher-LifeFitness-Comments)",
      "C08": "Electronics are stable, and mechanical components show low failure rates. Users report consistent performance even with varied user weight and cadence. Issues tend to be limited to belt tension adjustments or pedal strap replacements. Considered dependable for multi-user environments.\n(Sources: Technician-Reports; Dealer-Service-Logs)",
      "C09": "Intuitive console, smooth row stroke, and ergonomic handle shape make operation friendly for beginners. Seat tracking is exceptionally stable. Resistance curve is well balanced but slightly less linear than Concept2’s due to hybrid resistance tuning. Good overall ease of use, especially for guided workouts.\n(Sources: LifeFitness-User-Guides; Boutique-Rowing-Studio-Feedback)",
      "C10": "Outstanding domestic service network with widely available parts, including belts, bearings, electronics, and footboard assemblies. Technicians frequently stock common Heat Row components. One of the strongest in this comparison.\n(Sources: LifeFitness-US-Service-Locator; Commercial-Technician-Reviews)",
      "C11": "Modern, sculpted design with premium materials. More visually refined than Xebex and Concept2, though slightly less dramatic than Technogym Skillrow. Fits well in boutique studios, condominiums, and premium hotel gyms.\n(Sources: LifeFitness-HeatRow-Photos; Commercial-Installations)",
      "C14": 330,
      "C15": "85 x 28 x 47"
    },
    {
      "vendorid": "V01",
      "equipmentid": "E08",
      "brandid": "B02",
      "vendor": "Advanced Exercise",
      "equipment": "Bench",
      "brand": "Life Fitness",
      "model": "Adjustable LBR-AD",
      "qty": 1,
      "baseUnitPrice": 1139.2,
      "allInUnitPrice": 1488.002859873341,
      "overallScore": 8.337817481879862,
      "url": "https://shop.lifefitness.com/products/life-fitness-adjustable-bench?_gl=1*w3dv1*_up*MQ..&gclid=CjwKCAiA_orJBhBNEiwABkdmjFDdcKb8lT1Y7ShsomSJgfV7BovK2TyxHYK8ryR0tqEUQaPnNPCNThoCZXAQAvD_BwE&gbraid=0AAAAAD_h8npKyzklI9nY3MAc9ODf14VPG",
      "S01": 8.5,
      "S02": 9.25,
      "S03": 6.154650486471129,
      "S04": 8.25,
      "S05": 9,
      "S06": 8.5,
      "S07": 8.5,
      "S08": 9.5,
      "S09": 6.4,
      "S10": 9.229090909090909,
      "S11": 8.78048780487805,
      "S12": 8.337817481879862,
      "C02": 1375,
      "C03": 72,
      "C04": "High-quality welded frame with refined pad shaping and robust ladder-style adjustment. Upholstery and padding exceed most benches at this price tier. Movement mechanics feel premium, and overall build quality aligns with Life Fitness’s light-commercial offerings.\n(Sources: LifeFitness-Bench-ProductPage; Dealer-LBR-AD-Listings; Corporate-Fitness-Equipment-Reviews)",
      "C05": "At only 72 lbs, this is the lightest bench in the group and the easiest to relocate. Wheel system is smooth, large enough for uneven surfaces, and designed for frequent movement in commercial environments. Front transport handle is well-shaped and reduces strain when tilting the bench to roll. Users and technicians consistently note that the LBR-AD is among the easiest commercial benches to maneuver.\n(Sources: LifeFitness-US-Service-Locator; Commercial-Gym-Operator-Reviews)",
      "C06": "7/3/1",
      "C07": "Strong durability in multi-unit environments. Pads, ladder mechanisms, and frame components withstand long-term use. Wear items like upholstery and feet hold up well. Slightly superior long-term durability vs. Precor and Matrix at this tier.\n(Sources: Refurbisher-LifeFitness-Reports; Commercial-Installer-Notes)",
      "C08": "Known for stable long-term alignment of pads and secure ladder engagement. Locking positions rarely slip, and few mechanical failures are reported. Life Fitness benches often remain in service for very long periods in hospitality gyms.\n(Sources: Technician-Reports; Dealer-Service-Logs)",
      "C09": "Highly refined adjustment system with multiple back and seat positions that lock firmly and smoothly. Padding is more contoured and supportive than Precor or Matrix, providing better comfort for a wide range of users. Bench height is ergonomically ideal for mounting and dismounting and offers excellent lower-body stability during lifts. Handle and seat adjustments are intuitive, and the overall feel is premium and user-friendly.\n(Sources: LifeFitness-LBRAD-ProductPage; Commercial-Dealer-Notes; Boutique-Studio-Feedback)",
      "C10": "Among the strongest in the industry. Pads, rollers, hardware, and frame components are widely stocked. Service coverage in major U.S. cities is excellent.\n(Sources: LifeFitness-US-Service-Locator; Commercial-Technician-Reviews)",
      "C11": "Modern, polished, and visually refined. Cleaner lines than Precor or Matrix. Fits well in condo gyms seeking higher-end appearance.\n(Sources: LifeFitness-Bench-Photos; Commercial-Installations)",
      "C14": 500,
      "C15": "55 x 25 x 45"
    },
    {
      "vendorid": "V02",
      "equipmentid": "E01",
      "brandid": "B04",
      "vendor": "Marathon Fitness",
      "equipment": "Dual Pulley",
      "brand": "Precor",
      "model": "FTS Glide",
      "qty": 1,
      "baseUnitPrice": 3903.75,
      "allInUnitPrice": 5551.265745232701,
      "overallScore": 9.010507719000996,
      "url": "https://precorathome.com/products/fts-glide-strength",
      "S01": 9.5,
      "S02": 9.75,
      "S03": 9.526378138822103,
      "S04": 9,
      "S05": 7.5,
      "S06": 9,
      "S07": 9,
      "S08": 9,
      "S09": 7.333333333333333,
      "S10": 10,
      "S11": 7.567567567567568,
      "S12": 9.010507719000996,
      "C02": 2544,
      "C03": 672,
      "C04": "Commercial 11-gauge steel frame with welded construction and a simple, boxy geometry. Pulley housings and carriage tracks are robust and stable under load. Fit and finish are strong, though less refined than Life Fitness Signature or Technogym units. Designed for long-term stability in multi-user environments such as hotels and small facilities.\n(Precor-FTS-Brochure-NA-2024; Precor-FTS-AssemblyGuide-2016; FitnessZone-Precor-FTS-DealerPage)",
      "C05": 200,
      "C06": "10/5/1",
      "C07": "Long track record of durability in light-commercial environments. 11-gauge frame and carriage components hold up well over years of use. Routine cable and pulley wear is typical but manageable. Frequently installed in hospitality and small fitness facilities with few structural issues reported.\n(Precor-FTS-Brochure-NA-2024; AmericanHomeFitness-Precor-FTS; PushPedalPull-Precor-FTS-Review)",
      "C08": "Generally described as a low-maintenance, high-reliability unit in light-commercial facilities. Cable and pulley replacements occur at expected intervals, but structural and mechanical issues are uncommon. Considered a “set it and forget it” machine by many facility operators.\n(Precor-FTS-Brochure-NA-2024; AmericanHomeFitness-Precor-FTS; Precor-FTS-Review)",
      "C09": "Wide range of carriage positions with intuitive adjustments. Instructional placards and QR-linked videos support ease of use. Pulleys move smoothly, and adjustments are accessible for novice and experienced users.\n(Precor-FTS-Home-ProductPage; Precor-FTS-Brochure-NA-2024)",
      "C10": "Precor maintains strong U.S. service coverage with readily available parts through multiple commercial distributors. Replacement cables, pulleys, and hardware are easily sourced, supporting quick repair turnaround times.\n(Precor-Service-Network; Commercial-Dealer-Feedback)",
      "C11": "Clean and professional appearance with a straightforward commercial look. Exposed frame elements give it a functional aesthetic commonly seen in small fitness rooms and hospitality gyms.\n(Precor-Commercial-Photos; HotelGym-Precor-Installations)",
      "C14": "2:1 ratio; multi-position carriage",
      "C15": "53 x 48 x 85"
    },
    {
      "vendorid": "V02",
      "equipmentid": "E02",
      "brandid": "B04",
      "vendor": "Marathon Fitness",
      "equipment": "Leg Ext/Curl",
      "brand": "Precor",
      "model": "Vitality C027BP",
      "qty": 1,
      "baseUnitPrice": 3261.6,
      "allInUnitPrice": 4411.1322081956405,
      "overallScore": 8.856346544715448,
      "url": "https://static.precor.com/sell-sheet/all/VSL/VSL027BP-Leg-Curl-Leg-Extension-NA.pdf",
      "S01": 9,
      "S02": 7.984320557491289,
      "S03": 10,
      "S04": 9,
      "S05": 8,
      "S06": 9,
      "S07": 9,
      "S08": 9.5,
      "S09": 7.333333333333333,
      "S10": 10,
      "S11": 9.6875,
      "S12": 8.856346544715448,
      "C02": 2520,
      "C03": 620,
      "C04": "Heavy-duty commercial welded frame with 11-gauge steel and rigid footplate structure. Cam and linkage system provides smooth transitions between extension and curl settings. Upholstery and pads are firm and durable, though less sculpted than premium European machines. Designed for multi-user environments including hotels and mid-sized fitness facilities.\n(Precor-Discovery-Series-ProductPage; Commercial-Dealer-Precor-Listings)",
      "C05": 200,
      "C06": "10/5/1",
      "C07": "Selectorized stack and cable routing are engineered for frequent use in hospitality and light-commercial settings. Typical wear occurs in pads and pivot bushings but major mechanical failures are rare. Units in hotel and corporate gyms often remain in service for many years with standard preventive maintenance.\n(Precor-Commercial-Sales-Materials; Service-Tech-Reports)",
      "C08": "Consistently reliable operation with predictable maintenance needs. Cables and bearings require occasional replacement but the cam design and weight stack assembly maintain long-term stability. Considered a dependable “workhorse” in environments with varied users.\n(Precor-Discovery-Series; Facility-Operator-Feedback)",
      "C09": "Clearly labeled adjustment points support quick transitions between movements. Fixed seat and adjustable leg pads accommodate a broad user population. Motion path is intuitive for both novice and experienced users.\n(Precor-Commercial-User-Guides)",
      "C10": "Strong U.S. parts availability through Precor’s commercial network. Replacement pads, cams, bushings, and cables are easy to source, and many technicians regularly stock common components.\n(Precor-Service-Network)",
      "C11": "Functional commercial appearance with exposed frame and standard stack shroud. Not designed as a showpiece but blends well in typical multi-unit fitness rooms.\n(Precor-Commercial-Installations)",
      "C14": "1:1 selectorized",
      "C15": "60 x 42 x 57"
    },
    {
      "vendorid": "V02",
      "equipmentid": "E03",
      "brandid": "B04",
      "vendor": "Marathon Fitness",
      "equipment": "Chest Press",
      "brand": "Precor",
      "model": "Vitality C001BP",
      "qty": 1,
      "baseUnitPrice": 2930.4,
      "allInUnitPrice": 4052.60820819564,
      "overallScore": 8.642603733459978,
      "url": "https://static.precor.com/sell-sheet/all/VSL/VSL001BP-Chest-Press-NA.pdf",
      "S01": 8,
      "S02": 9.75,
      "S03": 9.341718924546335,
      "S04": 9,
      "S05": 8,
      "S06": 8,
      "S07": 8,
      "S08": 9,
      "S09": 7.333333333333333,
      "S10": 10,
      "S11": 7.993079584775087,
      "S12": 8.642603733459978,
      "C02": 2028,
      "C03": 462,
      "C04": "Commercial welded steel frame with a compact, space-efficient footprint and enclosed weight stack. Movement arms track smoothly through the press path with minimal side play. Upholstery and pads are firm and functional, though less sculpted and refined than premium European lines. Overall build is appropriate for hotel, HOA, and small-facility installations rather than flagship club floors.",
      "C05": 240,
      "C06": "10/5/1",
      "C07": "Engineered for light- to mid-volume commercial environments such as hospitality and multi-unit housing gyms. Frame, guide rods, and stack components hold up well under regular daily use with routine maintenance. Wear items like pads, grips, and cables follow predictable replacement cycles but rarely compromise structural integrity. Long-term durability is solid for its category.",
      "C08": "Mechanical operation is stable and consistent, with few chronic issues beyond normal cable and bushing wear. Weight stack and selector system are straightforward and tend to stay aligned over time. In multi-user environments, the machine generally behaves as a dependable “workhorse” piece when preventive maintenance is followed. Overall reliability is good for HOA and hospitality settings.",
      "C09": "Seat and back adjustments are simple, with clearly marked positions that accommodate a wide range of users. The press path is familiar and feels intuitive even for beginners and older adults. Handles offer a comfortable grip and natural wrist position, and the starting position is easy to enter without excessive shoulder strain. Instructional placard is basic but adequate for general fitness users.",
      "C10": "Precor maintains strong U.S. parts distribution with good access to cables, pads, bearings, and hardware. Many commercial technicians routinely carry compatible Precor components, which helps keep downtime low. Service response is typically fast in larger metro areas where hospitality installations are common. Overall, support and parts availability are a strength for this unit.",
      "C11": "Functional, no-nonsense commercial appearance with exposed frame elements and a standard shroud. It blends cleanly into typical condo and hotel fitness rooms without drawing attention. Finish quality is professional but not showpiece-level, sitting below Technogym and the most sculpted Life Fitness lines. Visually, it reads as durable and purposeful rather than luxurious.",
      "C14": "1:1 selectorized",
      "C15": "39 x 52 x 69"
    },
    {
      "vendorid": "V02",
      "equipmentid": "E04",
      "brandid": "B04",
      "vendor": "Marathon Fitness",
      "equipment": "Treadmill",
      "brand": "Precor",
      "model": "TRM 531 P31 Console",
      "qty": 2,
      "baseUnitPrice": 3828.4,
      "allInUnitPrice": 5272.131345235752,
      "overallScore": 8.72576768164492,
      "url": "https://www.precor.com/en-US/cardio/treadmills/500-line",
      "S01": 9,
      "S02": 8.5625,
      "S03": 8.790586530844601,
      "S04": 9,
      "S05": 8.5,
      "S06": 8.75,
      "S07": 8.75,
      "S08": 9,
      "S09": 7.333333333333333,
      "S10": 8.90961262553802,
      "S11": 10,
      "S12": 8.72576768164492,
      "C02": 2788,
      "C03": 395,
      "C04": "Commercial-grade welded frame with a robust deck structure and integrated lift system. Features Precor’s Ground Effects® impact control technology, which distributes cushioning evenly and reduces stress on lower joints. Mechanical refinement is solid, though finish and overall polish sit below premium Technogym and Life Fitness consoles. Designed specifically for hospitality, corporate wellness, and small commercial facilities.\n(Sources: Precor-TRM531-ProductPage; Precor-Commercial-Brochure; Hotel-Gym-Installer-Feedback)",
      "C05": 8,
      "C06": "10/5/1",
      "C07": "Deck, belt, and lift motors have a strong durability record in hotel and multi-unit fitness rooms. Typical wear components—belt, deck laminate, and lift motor—hold up well under moderate daily use. Units are commonly reported to remain operational for long life cycles with standard preventive maintenance.\n(Sources: Precor-Service-Reports; Hospitality-Fitness-Operator-Feedback)",
      "C08": "Very predictable mechanical behavior with few chronic issues reported. Electronics are stable, and mechanical breakdowns tend to be limited to standard belt/deck wear or lift motor replacements. Considered a reliable “workhorse” treadmill for hospitality and corporate gyms.\n(Sources: Precor-TRM531-DealerListings; Fitness-Technician-Reports)",
      "C09": "Straightforward LED console with intuitive interface. Low step-up height (8\") is highly accessible for older adults and deconditioned users. Quick start and quick keys make basic operation easy without training.\n(Sources: Precor-Commercial-User-Guides)",
      "C10": "Strong U.S. parts availability through Precor’s long-standing commercial service network. Technicians commonly stock Precor belts, decks, and lift motors. Turnaround time for repairs tends to be fast in major metro areas.\n(Sources: Precor-Service-Network; Commercial-Installer-Feedback)",
      "C11": "Functional, professional appearance with a clean commercial look. Not a premium showpiece; console design is utilitarian compared to Technogym and newer domestic models. Fits unobtrusively in multi-unit gyms.\n(Sources: Precor-Commercial-Installations)",
      "C14": 350,
      "C15": "82 x 34 x 66"
    },
    {
      "vendorid": "V02",
      "equipmentid": "E05",
      "brandid": "B04",
      "vendor": "Marathon Fitness",
      "equipment": "Elliptical",
      "brand": "Precor",
      "model": "EFX 535 P31 Console",
      "qty": 2,
      "baseUnitPrice": 3549.6,
      "allInUnitPrice": 4949.489836269829,
      "overallScore": 8.670723075508226,
      "url": "https://static.precor.com/sell-sheet/all/EFX/EFX500-Product-Brochures-NA.pdf?_gl=1*in71wk*_gcl_aw*R0NMLjE3NjQyMTk1MDUuQ2p3S0NBaUE1NXJKQmhCeUVpd0FGa1kxUU00NlVhek9ZRVFpcmRKNlFlczZfRERhNlN0djhqOFA0RHFzQkg5Sjd2ZU00dVczRGFMeVlCb0NYcUVRQXZEX0J3RQ..*_gcl_dc*R0NMLjE3NjQwNTI0ODcuQ2p3S0NBaUFfb3JKQmhCTkVpd0FCa2Rtak51b2tmWnN3d1BJMU1KVlI5YWlCTWh0V3RHZDdFQkhGMTZMSmkyeGFNLVZBbXRKbDdoaUdob0NBYzRRQXZEX0J3RQ..*_gcl_au*ODE1ODI2NDI2LjE3NjM4NDM5MjY.",
      "S01": 9,
      "S02": 9.5,
      "S03": 8.707488694380963,
      "S04": 9,
      "S05": 8.5,
      "S06": 8.5,
      "S07": 9,
      "S08": 8.5,
      "S09": 6.4,
      "S10": 7.143869596031184,
      "S11": 8.363095238095239,
      "S12": 8.670723075508226,
      "C02": 2822,
      "C03": 281,
      "C04": "Commercial-grade welded steel frame with a solid front-drive system. The EFX line is widely deployed in corporate gyms, hotels, and university recreation centers. Mechanical layout is straightforward, and the CrossRamp system is rugged but less refined than premium European designs. The fit and finish match Precor’s long-standing reputation for durable, functional construction.\n(Sources: Precor-EFX535-ProductPage; Commercial-Dealer-Listings; Hospitality-Fitness-Installer-Notes)",
      "C05": 8,
      "C06": "7/3/1",
      "C07": "Known for long-term performance in multi-user environments. Bearings, ramp wheels, and drive components show predictable wear patterns and often last for many years with routine maintenance. Many commercial operators report extremely long life cycles with standard belt/wheel replacements.\n(Sources: Precor-Service-Reports; Refurbished-Precor-Listings; Hotel-Gym-Feedback)",
      "C08": "Very few chronic mechanical issues outside normal pedal linkage wear. Electronics are stable and typically outlast the mechanical components. Frequently described as a 'workhorse' elliptical in hospitality and corporate settings.\n(Sources: Technician-Reports; Dealer-Precor-Resale-Data)",
      "C09": "Low step-up height (8”) and simple LED interface make the unit accessible for older adults and first-time users. Fixed stride and ramp configuration offer consistency and reduce setup complexity.\n(Sources: Precor-EFX-UserGuides; Corporate-Fitness-Operator-Feedback)",
      "C10": "Strong availability of replacement parts, including ramp wheels, bearings, pedals, and electronics. Precor has deep service coverage in the U.S., and most technicians regularly carry common wear parts.\n(Sources: Precor-Service-Network; Commercial-Technician-Reviews)",
      "C11": "Functional commercial look with exposed frame elements. Not designed as a showpiece, but presents a clean, professional aesthetic that fits well in multi-unit gyms.\n(Sources: Precor-Commercial-Installations)",
      "C14": 20,
      "C15": "83 x 34 x 64"
    },
    {
      "vendorid": "V02",
      "equipmentid": "E06",
      "brandid": "B04",
      "vendor": "Marathon Fitness",
      "equipment": "Recumbent Bike",
      "brand": "Precor",
      "model": "RBK 635 P31 Console",
      "qty": 1,
      "baseUnitPrice": 2529.6,
      "allInUnitPrice": 3053.786657936771,
      "overallScore": 8.94483412322275,
      "url": "https://static.precor.com/sell-sheet/en-us/RBK-600-Brochure-NA.pdf?_gl=1*1dkxf9b*_gcl_aw*R0NMLjE3NjQyMTk1MDUuQ2p3S0NBaUE1NXJKQmhCeUVpd0FGa1kxUU00NlVhek9ZRVFpcmRKNlFlczZfRERhNlN0djhqOFA0RHFzQkg5Sjd2ZU00dVczRGFMeVlCb0NYcUVRQXZEX0J3RQ..*_gcl_dc*R0NMLjE3NjQwNTI0ODcuQ2p3S0NBaUFfb3JKQmhCTkVpd0FCa2Rtak51b2tmWnN3d1BJMU1KVlI5YWlCTWh0V3RHZDdFQkhGMTZMSmkyeGFNLVZBbXRKbDdoaUdob0NBYzRRQXZEX0J3RQ..*_gcl_au*ODE1ODI2NDI2LjE3NjM4NDM5MjY.",
      "S01": 9,
      "S02": 9.5,
      "S03": 10,
      "S04": 9,
      "S05": 8.5,
      "S06": 8,
      "S07": 9,
      "S08": 9,
      "S09": 6.4,
      "S10": 10,
      "S11": 8.483412322274882,
      "S12": 8.94483412322275,
      "C02": 903,
      "C03": 179,
      "C04": "Commercial-grade welded steel frame with a stable single-rail seat system and a front-mounted drive mechanism. The RBK 635 is widely installed in hospitality and corporate wellness centers, where operators report strong structural stability and long-term mechanical consistency. Plastics and seat components are functional rather than premium, and overall refinement is slightly below Life Fitness and Technogym, but the design aligns with Precor’s reputation for durable, no-nonsense construction.\n(Sources: Precor-RBK635-ProductPage; Commercial-Dealer-Listings; Hospitality-Fitness-Installer-Notes)",
      "C05": "Low, unobstructed walk-through frame design with ample space between seat and front shroud. Seat height and rail geometry allow easy entry for older users and those with mobility limitations. Grab handles and seat-side supports make mounting and dismounting straightforward, giving the RBK 635 strong accessibility within the commercial recumbent category.\n(Sources: Precor-RBK-User-Guides; Corporate-Fitness-Operator-Feedback)",
      "C06": "7/3/1",
      "C07": "Drive belt, bearings, and seat rail components show long-term durability in hotels and apartment gyms. Wear items such as seat pads and pedal straps follow predictable replacement cycles, and many units in hospitality settings remain in service well beyond typical refresh periods with routine preventive maintenance. The mechanical layout is simple and resilient, lowering long-term ownership costs.\n(Sources: Precor-Service-Reports; Refurbished-Precor-Listings; Hotel-Gym-Feedback)",
      "C08": "Reliability is a strong point for the RBK 635, with technicians reporting few chronic mechanical or electronic issues. Console behavior is stable, pedal crank assemblies hold alignment over time, and failures are typically limited to routine wear components. Considered a dependable “workhorse” recumbent in multi-user environments.\n(Sources: Technician-Reports; Precor-Dealer-Resale-Data; Commercial-Gym-Maintenance-Feedback)",
      "C09": "Simple LED interface with intuitive controls and clearly marked seat adjustments. Step-thru design and moderate seat height make the bike accessible to seniors and users with limited mobility. Pedal straps and handles are easy to adjust, and the consistent pedaling motion is familiar for first-time and regular users alike.\n(Sources: Precor-RBK-User-Guides; Corporate-Fitness-Operator-Feedback)",
      "C10": "Precor maintains strong parts coverage in the U.S., with widely available replacement belts, bearings, pedals, and electronic components. Many commercial technicians routinely stock RBK-series parts, resulting in generally fast turnaround times for repairs and preventive maintenance.\n(SSources: Precor-Service-Network; Commercial-Technician-Reviews; Dealer-Service-Listings)",
      "C11": "Functional commercial appearance with a straightforward frame geometry and minimal sculpting. Not designed as a premium showpiece but blends cleanly into multi-unit and hospitality fitness rooms. Aesthetic refinement is below Life Fitness and Technogym but suitable for environments prioritizing durability and usability over visual impact.\n(Sources: Precor-Commercial-Installations; Hospitality-Gym-Photo-Galleries)",
      "C14": 350,
      "C15": "43 x 21 x 57"
    },
    {
      "vendorid": "V02",
      "equipmentid": "E07",
      "brandid": "B07",
      "vendor": "Marathon Fitness",
      "equipment": "Rower",
      "brand": "Xebex",
      "model": "Fitness Rower 3.0",
      "qty": 1,
      "baseUnitPrice": 1075.5,
      "allInUnitPrice": 1302.8794302379936,
      "overallScore": 8.11818672953005,
      "url": "https://xebexfitness.com/product/air-rower-2-0-smart-connectar-2-ba/",
      "S01": 8,
      "S02": 8,
      "S03": 9.866848664112645,
      "S04": 9,
      "S05": 7,
      "S06": 7.5,
      "S07": 8,
      "S08": 9,
      "S09": 4.095238095238095,
      "S10": 10,
      "S11": 6.940298507462686,
      "S12": 8.11818672953005,
      "C02": 1508,
      "C03": 93,
      "C04": "Sturdy steel frame with dual aluminum rails, a commercial belt-driven resistance system, and reinforced footplates. The construction feels solid for the price range and is commonly used in high-volume CrossFit boxes and hotel fitness rooms under the Xebex brand. Fit and finish are functional rather than premium, with basic plastics and a simple console. Not as refined as Life Fitness Heat Row or Technogym Skillrow, but structurally dependable for multi-user environments.\n(Sources: Xebex-AirRower-2.0-ProductPage; CrossFit-Gym-Operator-Reviews; Refurbisher-Xebex-Notes)",
      "C05": "Seat height is moderately elevated relative to low-profile Concept2 units, making entry easier for older adults. The long, open rail provides enough clearance to step over comfortably. However, the frame does not include assist handles, and the front housing sits slightly higher than some competitors, which may require more forward lean when mounting. Accessibility is good for most users but not optimized for seniors or limited-mobility populations.\n(Sources: Xebex-User-Guides; Hotel-Fitness-Operator-Feedback)",
      "C06": "5/2/0",
      "C07": "Air resistance system and internal belt mechanism show strong long-term durability in group training facilities and corporate gyms. Frame welds and rails hold up well under repeated daily use. Wear items include the belt, seat rollers, and foot straps, which have predictable replacement intervals. Overall durability is solid for the price class and often compared favorably to Concept2 equivalents.\n(Sources: Refurbished-Xebex-Listings; Technician-Reports; Cross-Training-Gym-Feedback)",
      "C08": "Electronics are simple and tend to be stable over time. Belt tension system maintains consistency, with few chronic failures reported. Rail alignment remains true over multi-year usage. Mechanical issues typically involve standard wear items and are infrequent. Considered a reliable, low-maintenance unit in commercial settings.\n(Sources: Xebex-Service-Reports; Dealer-Resale-Data)",
      "C09": "Console is basic but straightforward, with simple buttons and quick-start functionality. Air-only resistance provides predictable response, and seat glide is smooth. Footplate adjustments are manual but intuitive. Less refined than Life Fitness Heat Row’s ergonomics but easier to learn than Technogym Skillrow’s advanced training features.\n(Sources: Xebex-User-Guides; Corporate-Fitness-Operator-Feedback)",
      "C10": "Xebex parts are widely available in the U.S. through dealers and third-party refurbishers. Belts, seat rollers, and electronics are commonly stocked. Technicians familiar with Concept2 often report easy serviceability due to similar mechanical layouts. Coverage is good, though not as dense as Life Fitness.\n(Sources: Service-Tech-Reviews; Dealer-Parts-Listings)",
      "C11": "Functional, industrial appearance with minimal styling. Not intended as a premium visual piece but blends into performance-oriented training spaces. Less refined than Life Fitness and Technogym but suitable for multi-unit gyms prioritizing function over form.\n(Sources: Commercial-Gym-Installations)",
      "C14": 500,
      "C15": "58 x 26 x 15"
    },
    {
      "vendorid": "V02",
      "equipmentid": "E08",
      "brandid": "B04",
      "vendor": "Marathon Fitness",
      "equipment": "Bench",
      "brand": "Precor",
      "model": "Precor VBR6117",
      "qty": 1,
      "baseUnitPrice": 712.8,
      "allInUnitPrice": 950.3440121900924,
      "overallScore": 8.77806528543017,
      "url": "https://static.precor.com/sell-sheet/all/VBR6117-Flat-Incline-Decline-Bench-Product-Brochure-NA.pdf?_gl=1*1v7xz14*_gcl_aw*R0NMLjE3NjQwNTI0ODcuQ2p3S0NBaUFfb3JKQmhCTkVpd0FCa2Rtak51b2tmWnN3d1BJMU1KVlI5YWlCTWh0V3RHZDdFQkhGMTZMSmkyeGFNLVZBbXRKbDdoaUdob0NBYzRRQXZEX0J3RQ..*_gcl_dc*R0NMLjE3NjQwNTI0ODcuQ2p3S0NBaUFfb3JKQmhCTkVpd0FCa2Rtak51b2tmWnN3d1BJMU1KVlI5YWlCTWh0V3RHZDdFQkhGMTZMSmkyeGFNLVZBbXRKbDdoaUdob0NBYzRRQXZEX0J3RQ..*_gcl_au*ODE1ODI2NDI2LjE3NjM4NDM5MjY.",
      "S01": 9,
      "S02": 9,
      "S03": 9.636655156362512,
      "S04": 9,
      "S05": 8,
      "S06": 9,
      "S07": 9,
      "S08": 9,
      "S09": 6.4,
      "S10": 7.833333333333333,
      "S11": 10,
      "S12": 8.77806528543017,
      "C02": 1620,
      "C03": 82,
      "C04": "Commercial-grade welded steel frame with a simple but sturdy design. Padding is firm and durable, with stitching that holds up well in hotel and corporate fitness rooms. Movement arm and ladder-style adjustment mechanism are functional and robust, though less refined than Life Fitness or Technogym. Widely reviewed as a “workhorse” light-commercial bench appropriate for multi-user environments.\n(Sources: Precor-Strength-Catalog; Commercial-Dealer-Precor-Bench-Listings; Hotel-Gym-Equipment-Reviews)",
      "C05": "At 82 lbs, the bench is somewhat heavier than entry-level models but still manageable. Rear wheels are functional and durable, though slightly smaller than those on Life Fitness's LBR series. Front handle cutout makes lifting possible but not as ergonomic as dedicated transport handles found on higher-end benches. Rolling is smooth on rubberized floors but requires a slightly higher lift angle due to wheel placement. Overall mobility is good but not optimized.\n(Sources: Commercial-Installer-Feedback; Precor-Dealer-Mobility-Notes)",
      "C06": "7/3/1",
      "C07": "Long-term durability is solid in hospitality and corporate settings. Frame welds and adjustment ladder show slow wear over time; pads hold shape but stitching may show cosmetic fray in high-use gyms. Very few structural issues reported across refurbisher inventories.\n(Sources: Refurbished-Precor-Listings; Technician-Reports; Dealer-Resale-Data)",
      "C08": "Mechanically dependable with few moving parts. Adjustment ladder locks securely and maintains alignment. Rollers and feet maintain integrity over years of multi-user operation. Breakdowns are uncommon due to simple design.\n(Sources: Fitness-Technician-Feedback; Commercial-Precor-Maintenance-Logs)",
      "C09": "Back pad adjustments are straightforward using a simple ladder-style system with firm racking positions. Seat pad has limited adjustability but moves smoothly through its notches. Bench height is moderate, making mounting and dismounting easy for most users, though not as ergonomic as Life Fitness or Technogym models with more sculpted pads. Stability during pressing movements is solid due to the wide rear base. Padding is firm but slightly less contoured than premium benches, offering functional but basic comfort.  It is the only bench among the 4 that can decline also.\n(Sources: Precor-VBR6117-ProductPage; Commercial-Gym-Operator-Reviews; Dealer-Equipment-Notes)",
      "C10": "Strong U.S. parts availability through Precor’s commercial service network. Pads, rollers, hardware, and feet are commonly stocked. Very fast turnaround time in major metro areas.\n(Sources: Precor-Service-Network; Commercial-Technician-Reviews)",
      "C11": "Functional, utilitarian commercial appearance. Not premium or sculpted but blends into condo/hotel gyms without drawing attention.\n(Sources: Precor-Commercial-Installations)",
      "C14": 300,
      "C15": "54 x 30 x 18"
    },
    {
      "vendorid": "V03",
      "equipmentid": "E01",
      "brandid": "B03",
      "vendor": "Risher Fitness",
      "equipment": "Dual Pulley",
      "brand": "Matrix",
      "model": "Versa Functional Trainer",
      "qty": 1,
      "baseUnitPrice": 4199,
      "allInUnitPrice": 5288.345663817679,
      "overallScore": 8.52193752193752,
      "url": "https://us.matrixfitness.com/eng/strength/multi-station/vs-vft-functional-trainer-18",
      "S01": 8.25,
      "S02": 8.25,
      "S03": 10,
      "S04": 7.5,
      "S05": 8.5,
      "S06": 8.5,
      "S07": 8.5,
      "S08": 8.5,
      "S09": 8.4,
      "S10": 9.177489177489178,
      "S11": 8.806306306306306,
      "S12": 8.52193752193752,
      "C02": 2772,
      "C03": 782,
      "C04": "Commercial-grade steel frame with dual powder-coat finish and enclosed weight stacks. Pulley travel is smooth and frame stability is solid. Fit and finish are high quality for this segment, though clearly below Life Fitness and Technogym premium lines in refinement. Designed for frequent use in commercial and multi-user environments.\n(Matrix-Versa-FT-ProductPage-Johnson; Matrix-Versa-Compact-PerformanceHealth; ActiveFitness-MatrixVersa-Listing)",
      "C05": 150,
      "C06": "10/3/3",
      "C07": "Strong durability for a cable unit in light and full commercial environments. Enclosed stacks and internally lubricated cables reduce wear. Refurbishers frequently resell Matrix Versa units from gyms and hotels, indicating stable long-term mechanical performance.\n(Matrix-Versa-FT-ProductPage-Johnson; Commercial-Dealer-Matrix-Versa-Listings; Refurbished-Matrix-CableStations)",
      "C08": "Selectorized and cable systems within the Versa line have good reliability in light and full commercial gyms. Reported mechanical failures are infrequent and typically limited to normal cable or pulley wear. Often resold into secondary markets, indicating dependable long-term use.\n(Matrix-Versa-FT-ProductPage-Johnson; Commercial-Dealer-Matrix-Versa-Listings)",
      "C09": "Color-coded adjustment points and clear markings. Illustrative exercise placards are helpful for deconditioned or novice users. Standard 2:1 ratio provides predictable resistance. Designed for intuitive operation in general fitness environments.\n(Matrix-Versa-FT-ProductPage-Johnson; Matrix-Versa-Compact-PerformanceHealth)",
      "C10": "Good national service coverage via Johnson Health Tech. Multiple U.S. distributors support installation, maintenance, and replacement parts. Parts availability is generally reliable in metropolitan areas.\n(Johnson-HealthTech-US; Matrix-Versa-Commercial-Dealers)",
      "C11": "Contemporary appearance with clean lines and enclosed stacks. Professional look suitable for multi-unit facilities, though less stylized than Technogym’s premium designs.\n(Matrix-Versa-ProductPhotos; CorporateFitness-Matrix-Installations)",
      "C14": "2:1 ratio",
      "C15": "44 x 63 x 93.5"
    },
    {
      "vendorid": "V03",
      "equipmentid": "E02",
      "brandid": "B03",
      "vendor": "Risher Fitness",
      "equipment": "Leg Ext/Curl",
      "brand": "Matrix",
      "model": "Versa Duals Leg Extension/Curl (Standard)",
      "qty": 1,
      "baseUnitPrice": 3999,
      "allInUnitPrice": 4785.256700283733,
      "overallScore": 8.32723993106478,
      "url": "https://us.matrixfitness.com/eng/strength/single-station/vs-s711-leg-extension-seated-leg-curl",
      "S01": 8.25,
      "S02": 7.1624564459930316,
      "S03": 9.218172575640697,
      "S04": 7.5,
      "S05": 8.5,
      "S06": 8.5,
      "S07": 8.25,
      "S08": 8.5,
      "S09": 10,
      "S10": 9.022556390977442,
      "S11": 9.21875,
      "S12": 8.32723993106478,
      "C02": 2793,
      "C03": 590,
      "C04": "Commercial-grade steel frame with dual powder coating and enclosed weight stack. Linkage system provides smooth transitions, though mechanical refinement and pad sculpting fall slightly below Life Fitness and Technogym. Solid build appropriate for small gyms and multi-housing facilities.\n(Matrix-Versa-ProductPage; Commercial-Dealer-Matrix-Listings)",
      "C05": 160,
      "C06": "10/5/3",
      "C07": "Versa selectorized units have a good durability record in hospitality gyms and corporate fitness rooms. Components such as pads and bushings show moderate wear over time but structural failures are uncommon.\n(Refurbished-Matrix-LegMachines; Technician-Feedback)",
      "C08": "Cable and cam assemblies offer consistent performance across high usage cycles. Known for predictable operation with low incidence of chronic issues. Ranked slightly below Life Fitness in long-term mechanical stability.\n(Matrix-Commercial-Service-Reports)",
      "C09": "Adjustment levers are color-coded and accessible, but switching between extension and curl requires slightly more setup than Axiom. Motion path is smooth, though less ergonomic than premium models.\n(Matrix-Versa-User-Guides)",
      "C10": "Supported by Johnson Health Tech’s national service network, with solid parts availability in major markets. Replacement pads, cables, and hardware are routinely stocked by distributors.\n(Johnson-HealthTech-US)",
      "C11": "Modern, clean-lined design with enclosed stacks. Professional appearance suitable for multi-unit gyms, though styling is less refined than Technogym and slightly more industrial than Life Fitness.\n(Matrix-Versa-Installations)",
      "C14": "1:1 selectorized",
      "C15": "57 x 49 x 57"
    },
    {
      "vendorid": "V03",
      "equipmentid": "E03",
      "brandid": "B03",
      "vendor": "Risher Fitness",
      "equipment": "Chest Press",
      "brand": "Matrix",
      "model": "Versa Converging VS-S13",
      "qty": 1,
      "baseUnitPrice": 3015,
      "allInUnitPrice": 3785.832679227302,
      "overallScore": 8.035156201670274,
      "url": "https://us.matrixfitness.com/eng/strength/single-station/vs-s13-converging-chest-press",
      "S01": 8,
      "S02": 7.333333333333333,
      "S03": 10,
      "S04": 7.5,
      "S05": 7,
      "S06": 8,
      "S07": 8,
      "S08": 8,
      "S09": 10,
      "S10": 6.969790700072172,
      "S11": 10,
      "S12": 8.035156201670274,
      "C02": 2909.7,
      "C03": 578,
      "C04": "Commercial-grade steel frame with dual-layer powder coating and converging movement arms. The enclosed stack and linkage system feel solid, and motion is smooth across the press path. Upholstery and pads are well constructed, though slightly less refined than high-end Life Fitness or Technogym pieces. Overall build is robust and appropriate for small gyms, HOAs, and multi-housing facilities.",
      "C05": 160,
      "C06": "10/5/3",
      "C07": "Versa selectorized stations have a good track record in hospitality and corporate environments. Frame and movement arms tolerate regular daily use with minimal structural degradation. Wear items—pads, grips, and bushings—show normal ageing but rarely impact function when replaced on schedule. Durability is comfortably within the commercial range for this category.",
      "C08": "Mechanical reliability is generally strong, with cable and cam systems performing predictably over long service intervals. Most service events involve standard cable replacement or minor bushing wear, rather than major failures. The converging arm design remains stable and aligned under load, contributing to consistent performance. Overall reliability is a positive for multi-user facilities.",
      "C09": "Color-coded adjustment points and clear seat settings make the machine straightforward to set up. The converging press path feels natural for most users and provides a comfortable range of motion for chest training. Handles are easy to grasp and accommodate different shoulder widths, though the machine feels slightly more performance-oriented than Axiom. Setup remains manageable for older adults with minimal instruction.",
      "C10": "Matrix equipment benefits from Johnson Health Tech’s national service network. Parts such as cables, pads, and hardware are generally available through multiple distributors, especially in larger cities. Technician coverage is good, though not as dense as Life Fitness in some markets. Overall, service and parts access are reliable for HOAs and hospitality gyms.",
      "C11": "Modern, clean-lined appearance with enclosed stacks and a professional commercial profile. Styling is more contemporary than basic Precor units but less sculpted and “showpiece” than Technogym. The machine integrates well into multi-unit fitness rooms without dominating the space. Visually, it conveys a solid, up-to-date commercial feel.",
      "C14": "1:1 selectorized",
      "C15": "54.9 x 53 x 65.8"
    },
    {
      "vendorid": "V03",
      "equipmentid": "E04",
      "brandid": "B03",
      "vendor": "Risher Fitness",
      "equipment": "Treadmill",
      "brand": "Matrix",
      "model": "Lifestyle LED",
      "qty": 2,
      "baseUnitPrice": 3799,
      "allInUnitPrice": 4634.512679227302,
      "overallScore": 8.66810810566194,
      "url": "https://us.matrixfitness.com/eng/cardio/lifestyle/treadmill/led",
      "S01": 9,
      "S02": 9.142857142857142,
      "S03": 10,
      "S04": 7.5,
      "S05": 8,
      "S06": 8.5,
      "S07": 8.25,
      "S08": 9,
      "S09": 8.4,
      "S10": 8.810010214504596,
      "S11": 8.260759493670886,
      "S12": 8.66810810566194,
      "C02": 2819.5200000000004,
      "C03": 326.3,
      "C04": "Commercial-grade construction with welded steel frame and durable deck system. Cushioning is firm but consistent; fit and finish are solid for the price point. Build quality is slightly behind Life Fitness and Technogym but competitive with Precor.\n(Sources: Matrix-Lifestyle-ProductPage; Johnson-HealthTech-Commercial-Documents)",
      "C05": 7,
      "C06": "7/3/3",
      "C07": "Strong durability track record in hotels, apartments, and corporate fitness rooms. Belt and deck hold up well with fewer reported refinishing cycles than Precor in some environments. Electronics generally stable.\n(Sources: Matrix-Lifestyle-DealerListings; Hospitality-Gym-Operator-Feedback)",
      "C08": "Predictable mechanical reliability; break/fix issues are typically limited to belt alignment, lift motors, or console keypads. Broadly considered dependable and easier to maintain than some Precor units.\n(Sources: Technician-Reports; Refurbished-Matrix-Listings)",
      "C09": "LED console is simple, bright, and user-friendly. Step-up height (7\") is the lowest in the group, making it excellent for older adults. Controls are intuitive with large quick keys.\n(Sources: Matrix-Lifestyle-User-Guides)",
      "C10": "Strong national support through Johnson Health Tech. Parts—especially belts, motors, and electronics—are widely available. Slightly lower technician density than Life Fitness but generally reliable.\n(Sources: JHT-US-Service-Network)",
      "C11": "Clean and modern with professional commercial styling. Less premium than Technogym but sleek enough for multi-unit facilities.\n(Sources: Matrix-Commercial-Installations)",
      "C14": 400,
      "C15": "79.2 x 35.6 x 64.6"
    },
    {
      "vendorid": "V03",
      "equipmentid": "E05",
      "brandid": "B03",
      "vendor": "Risher Fitness",
      "equipment": "Elliptical",
      "brand": "Matrix",
      "model": "Matrix Lifestyle LED",
      "qty": 2,
      "baseUnitPrice": 3499,
      "allInUnitPrice": 4309.762679227302,
      "overallScore": 8.391969657215443,
      "url": "https://us.matrixfitness.com/eng/cardio/lifestyle/elliptical/led",
      "S01": 9,
      "S02": 8.895604395604396,
      "S03": 10,
      "S04": 7.5,
      "S05": 8,
      "S06": 8,
      "S07": 8,
      "S08": 9,
      "S09": 6.4,
      "S10": 7.150153217568946,
      "S11": 9.907738095238095,
      "S12": 8.391969657215443,
      "C02": 2819.5200000000004,
      "C03": 332.9,
      "C04": "Commercial-grade steel frame with durable pedal linkages and a stable drive system. Fit and finish are good for the price point, though movement quality is slightly firmer than Life Fitness. Suitable for multi-unit housing and light-commercial gyms.\n(Sources: Matrix-Lifestyle-ProductPage; Commercial-Dealer-Matrix-Listings)",
      "C05": 9.1,
      "C06": "7/3/1",
      "C07": "Solid durability record in hotels and apartments. Bearings and linkage components show moderate wear but rarely fail prematurely. Electronics are generally stable.\n(Sources: Refurbished-Matrix-Listings; Hospitality-Fitness-Operator-Feedback)",
      "C08": "Mechanical reliability is strong, with most issues limited to pedal bushings, console keypads, or occasional belt alignment. Considered easy to service and maintain.\n(Sources: Matrix-Service-Reports; Technician-Feedback)",
      "C09": "LED console is clean, simple, and user-friendly. Step-up height (9.1”) is low enough for broad accessibility. Controls are intuitive and require minimal learning curve.\n(Sources: Matrix-Lifestyle-User-Guides",
      "C10": "Good U.S. support through Johnson Health Tech. Replacement parts for pedals, linkages, and electronics are widely available, though not as dense as Life Fitness.\n(Sources: JHT-US-Service-Network; Commercial-Dealer-Feedback)",
      "C11": "Modern, professional appearance with clean lines. Not as sculpted or premium as Technogym, but attractive and contemporary for multi-unit gyms.\n(Sources: Matrix-Commercial-Installations)",
      "C14": 20,
      "C15": "79.2 x 35.6 x 64.6"
    },
    {
      "vendorid": "V03",
      "equipmentid": "E06",
      "brandid": "B03",
      "vendor": "Risher Fitness",
      "equipment": "Recumbent Bike",
      "brand": "Matrix",
      "model": "Matrix Lifestyle LED",
      "qty": 1,
      "baseUnitPrice": 3099,
      "allInUnitPrice": 3601.6956291033343,
      "overallScore": 8.133914347039122,
      "url": "https://us.matrixfitness.com/eng/cardio/lifestyle/recumbent-cycle/led",
      "S01": 9,
      "S02": 9,
      "S03": 8.478747158035203,
      "S04": 7.5,
      "S05": 8,
      "S06": 8,
      "S07": 8,
      "S08": 9,
      "S09": 6.4,
      "S10": 5.469578121687514,
      "S11": 9.298578199052132,
      "S12": 8.133914347039122,
      "C02": 1650.9499999999998,
      "C03": 196.2,
      "C04": "Commercial-grade welded steel frame with durable seat rails and stable pedal mechanics. Fit and finish are solid for the price point, though overall refinement is slightly below Life Fitness. Drive system and plastics feel sturdy and well-suited for multi-unit housing gyms and light-commercial environments.\n(Sources: Matrix-Lifestyle-ProductPage; Commercial-Dealer-Matrix-Listings; Johnson-HealthTech-CommercialDocuments)",
      "C05": "Open step-through frame with adequate clearance for users of varying mobility levels. Seat adjustments glide smoothly, and side handles provide stable support. Accessibility is strong, though the seating geometry is slightly more upright and less sculpted than Life Fitness, which may influence comfort for some users.\n(Sources: Matrix-Lifestyle-User-Guides; Hospitality-Fitness-Operator-Feedback)",
      "C06": "7/3/1",
      "C07": "Matrix recumbents show solid durability in hotel and apartment gyms, with predictable wear of seat pads, bearings, and pedal straps. Structural failures are uncommon, and many refurbished units on the secondary market show long operational life with standard maintenance.\n(Sources: Refurbished-Matrix-Listings; Commercial-Gym-Maintenance-Reports)",
      "C08": "Mechanical reliability is good, with most issues limited to pedal bushings, occasional belt alignment, or console keypads. Console electronics are generally stable. Considered easy to service and maintain relative to competitors.\n(Sources: Matrix-Service-Reports; Technician-Feedback; Dealer-Service-Logs)",
      "C09": "LED console is simple and bright with intuitive controls. Step-through design is accessible, and seat adjustments accommodate a broad user range. Pedal straps and handlebars are easy to operate, making the unit user-friendly for first-time and older exercisers.\n(Sources: Matrix-Lifestyle-User-Guides; Corporate-Fitness-Operator-Feedback)",
      "C10": "Solid national support through Johnson Health Tech, with widely available parts for pedals, belts, bearings, and electronics. Technician density is strong in major metro areas, though slightly below Life Fitness.\n(Sources: JHT-US-Service-Network; Commercial-Dealer-Feedback)",
      "C11": "Modern, clean commercial styling with simple lines and a contemporary profile. Less sculpted and premium than Technogym or Life Fitness, but visually appealing and appropriate for multi-unit fitness environments.\n(Sources: Matrix-Commercial-Installations; Hotel-Gym-Photo-Libraries)",
      "C14": 400,
      "C15": "62.3 x 26.5 x 52.2"
    },
    {
      "vendorid": "V03",
      "equipmentid": "E07",
      "brandid": "B01",
      "vendor": "Risher Fitness",
      "equipment": "Rower",
      "brand": "Concept2",
      "model": "RowErg",
      "qty": 1,
      "baseUnitPrice": 950,
      "allInUnitPrice": 1285.531416574359,
      "overallScore": 8.430135039090263,
      "url": "https://www.concept2.com/ergs/rowerg?gad_source=1&gad_campaignid=13183977080&gbraid=0AAAAADAVrFvr2LObSUMG2hcWEvgxzQI7s&gclid=CjwKCAiA55rJBhByEiwAFkY1QGKtFnrTMYYEdgytvUaOjmHn17BySOEE1pGyQI96ZdBLlZIagqNBIxoCj00QAvD_BwE",
      "S01": 9,
      "S02": 8,
      "S03": 10,
      "S04": 7.5,
      "S05": 8.5,
      "S06": 8.5,
      "S07": 8,
      "S08": 8,
      "S09": 8.095238095238095,
      "S10": 8.656716417910447,
      "S11": 4.253731343283582,
      "S12": 8.430135039090263,
      "C02": 1742,
      "C03": 57,
      "C04": "Legendary commercial-grade construction with aluminum monorail, steel frame legs, and a chain drive system known for exceptional longevity. While the aesthetic is utilitarian, the engineering is elite-level. The RowErg remains the global standard for durability and performance.\n(Sources: Concept2-ProductPage; CrossFit-Official-Equipment-Standards; Olympic-Training-Center-Reviews)",
      "C05": "Seat height is low at 14 inches, which can be challenging for older adults or users with limited mobility. Concept2 offers a high-rise version, but your sheet lists the standard height. Stepping over the monorail requires more hip and knee mobility than the other rowers here. Accessibility is functional but the least senior-friendly in the group.\n(Sources: Concept2-User-Manual; Senior-Fitness-Operator-Notes)",
      "C06": "5/2/2",
      "C07": "Unmatched in the commercial cardio category. Units remain in service for 10–15+ years with only routine chain lubrication, bushing replacement, and occasional monitor updates. Known as the most durable rower on the market by a wide consensus.\n(Sources: Refurbished-Concept2-Listings; CrossFit-Gym-Operator-Feedback)",
      "C08": "Extremely reliable. Mechanical failures are rare. PM5 monitor is stable and widely supported. Chain drive system requires minimal maintenance. Considered a gold standard for reliability in multi-user, high-volume environments.\n(Sources: Technician-Reports; Collegiate-Rowing-Facility-Maintenance)",
      "C09": "Console is simple and accurate, though less visually polished than Life Fitness and Technogym. Rowing motion is extremely predictable and widely familiar to athletes. Foot straps are basic but effective. Very easy to learn but slightly less ergonomic for beginners than Skillrow’s motion path.\n(Sources: Concept2-User-Guides; Athletic-Training-Facility-Feedback)",
      "C10": "Best-in-class parts availability. Chain, sprockets, rollers, PM5 electronics, and rails are widely stocked across gyms, online retailers, and commercial distributors. Many facilities perform their own maintenance due to the simplicity of the design.\n(Sources: Concept2-Parts-Catalog; Technician-Feedback)",
      "C11": "Industrial, functional appearance. Not designed as a premium showpiece but has a professional, minimalist look that is recognizable in athletic and performance environments. Less visually refined than Life Fitness or Technogym.\n(Sources: Commercial-Installations; Elite-Training-Center-Photos)",
      "C14": 500,
      "C15": "67 x 26 x 51.5"
    },
    {
      "vendorid": "V03",
      "equipmentid": "E08",
      "brandid": "B03",
      "vendor": "Risher Fitness",
      "equipment": "Bench",
      "brand": "Matrix",
      "model": "Go Multi-Adj",
      "qty": 1,
      "baseUnitPrice": 768,
      "allInUnitPrice": 915.8137525389891,
      "overallScore": 8.418438338950136,
      "url": "https://us.matrixfitness.com/eng/strength/free-weights/go-ab-adjustable-bench",
      "S01": 9,
      "S02": 9,
      "S03": 10,
      "S04": 7.5,
      "S05": 8,
      "S06": 8,
      "S07": 8,
      "S08": 9,
      "S09": 6.4,
      "S10": 7.429742388758783,
      "S11": 9.695121951219512,
      "S12": 8.418438338950136,
      "C02": 1708,
      "C03": 79.5,
      "C04": "Commercial-grade frame with strong welds and solid hardware. Fit and finish are good for price point, but pad refinement and overall feel are slightly below Life Fitness. Adjustment mechanism is smooth and secure.\n(Sources: Matrix-Go-Bench-ProductPage; Johnson-HealthTech-CommercialDocs; Dealer-Matrix-Listings)",
      "C05": "Weighing 79.5 lbs, the bench has moderate mobility. Rear wheels roll cleanly on commercial flooring, but the front lifting point is less ergonomic than Life Fitness’s dedicated handle. The bench balances well during transport but requires more effort to tilt and roll compared to the LBR-AD. Mobility is good but not exceptional.\n(Sources: Commercial-Installer-Notes; Matrix-Dealer-Feedback)",
      "C06": "7/3/1",
      "C07": "Strong durability in multi-unit facilities. Pads resist wear well; frame welds are solid. Expected issues include pad wear and foot rubber degradation over time.\n(Sources: Refurbished-Matrix-Listings; Commercial-Maintenance-Reports)",
      "C08": "Reliable ladder mechanism and stable adjustment settings. Electronics are absent, so few failure points. Reports from hotels and multi-housing gyms indicate predictable, long-term performance.\n(Sources: Technician-Feedback; Dealer-Service-Logs)",
      "C09": "Adjustment levers are functional and allow multiple back pad settings, though the motion is slightly firmer than Life Fitness’s mechanism. Seat adjustments are adequate but less sculpted, which may affect comfort for some users during incline movements. Bench height is moderate and easy to mount. Stability is strong due to wide rear support, and the pad firmness offers good support for pressing. Overall ease of use is solid but less refined than Life Fitness or Technogym.\n(Sources: Matrix-Go-MultiAdj-ProductPage; Johnson-HealthTech-CommercialDocuments; Hospitality-Fitness-Operator-Feedback)",
      "C10": "Good U.S. coverage through Johnson Health Tech. Common pads, ladders, and hardware are widely available. Slightly fewer technicians than Life Fitness, but overall service remains reliable.\n(Sources: JHT-US-Service-Network; Commercial-Dealer-Feedback)",
      "C11": "Clean and modern with a simple, professional look. Not as sculpted or premium as Technogym, but visually pleasing for multi-unit gyms.\n(Sources: Matrix-Commercial-Installations)",
      "C14": 300,
      "C15": "56 x 30.5 x 17.25"
    },
    {
      "vendorid": "V04",
      "equipmentid": "E01",
      "brandid": "B05",
      "vendor": "Technogym",
      "equipment": "Dual Pulley",
      "brand": "Technogym",
      "model": "Dual Adjustable Pulley (DAP / MB430)",
      "qty": 1,
      "baseUnitPrice": 9462,
      "allInUnitPrice": 12289.100206002628,
      "overallScore": 7.817522287792365,
      "url": "https://www.technogym.com/en-US/product/dual-adjustable-pulley-fitness_MB44.html",
      "S01": 9,
      "S02": 6,
      "S03": 4.303281424326396,
      "S04": 7.5,
      "S05": 10,
      "S06": 10,
      "S07": 9.5,
      "S08": 7,
      "S09": 5.695238095238095,
      "S10": 8.327332242225859,
      "S11": 10,
      "S12": 7.817522287792365,
      "C02": 3055,
      "C03": 888,
      "C04": "Premium European commercial frame with precision machining, enclosed stacks, and a highly refined finish. Pulley housings, guide rails, and adjustment mechanisms are engineered for continuous club-level use. Consistently described as one of the smoothest and most refined cable stations in the industry.\n(Technogym-DAP-Fitness-ProductPage; Technogym-DAP-Performance-ProductPage; GlobalFitness-Used-Technogym-DAP)",
      "C05": 90,
      "C06": "5/2/2",
      "C07": "Engineered for continuous-use commercial environments with heavy-duty frame and high-end components. With routine maintenance, units often remain in service for many years in performance facilities. Premium components support long lifespan, though some parts may have longer lead times in North America.\n(Technogym-DAP-ProductPages; GlobalFitness-Used-Technogym-DAP; U.S.-Technogym-DealerListings)",
      "C08": "Highly reliable in commercial gym environments with smooth cable mechanics and stable performance. Failures are uncommon; however, U.S. facilities sometimes face extended repair times due to imported parts.\n(Technogym-DAP-ProductPages; U.S.-Technogym-DealerListings)",
      "C09": "Very wide range of pulley height positions with ergonomic handles. Highly versatile but can be less intuitive for older or inexperienced users due to complex adjustment options and more performance-oriented configuration.\n(Technogym-DAP-Fitness-ProductPage; PTA-Global-Technogym-DAP-TrainingVideo)",
      "C10": "Reliable service in markets with direct Technogym support, but more limited distributor presence elsewhere. Replacement parts often ship from Europe, leading to longer lead times for certain maintenance tasks.\n(Technogym-US-Service-Info; U.S.-Technogym-Distributors)",
      "C11": "Sleek Italian design with sculpted lines, enclosed stacks, and premium finish. Often a visual centerpiece in boutique studios and luxury hospitality gyms.\n(Technogym-DAP-ProductPhotos; Technogym-BoutiqueStudio-Showcase)",
      "C14": "2:1 ratio; 36 possible cable positions",
      "C15": "65 x 47 x 91"
    },
    {
      "vendorid": "V04",
      "equipmentid": "E02",
      "brandid": "B05",
      "vendor": "Technogym",
      "equipment": "Leg Ext/Curl",
      "brand": "Technogym",
      "model": "Selection 700 Leg Extension/Curl",
      "qty": 1,
      "baseUnitPrice": 6315.6,
      "allInUnitPrice": 8000.175418898875,
      "overallScore": 8.354132097210899,
      "url": "https://www.technogym.com/en-US/product/selection-700-dual-leg-curl-extension_MNMC.html",
      "S01": 9,
      "S02": 9,
      "S03": 5.513794357277703,
      "S04": 7.5,
      "S05": 10,
      "S06": 10,
      "S07": 9.5,
      "S08": 7,
      "S09": 4.361904761904762,
      "S10": 9.087630724846736,
      "S11": 10,
      "S12": 8.354132097210899,
      "C02": 2773,
      "C03": 640,
      "C04": "Premium European construction with advanced biomechanics and sculpted seat/pad geometry. Heavy-duty frame and enclosed stacks contribute to a very refined, high-end feel. One of the most premium builds available in commercial selectorized leg units.\n(Technogym-Selection-700-ProductPage; European-Commercial-Dealer-Listings)",
      "C05": 287,
      "C06": "5/2/1",
      "C07": "Engineered for continuous-use club environments. Linkage system, cams, and upholstery maintain quality under heavy daily training loads. Typically remains in service for many years with proper maintenance.\n(Technogym-Commercial-Sales-Materials)",
      "C08": "Mechanical failures are rare, though U.S. operators sometimes face longer downtime due to imported parts. Smooth cable/pulley operation is a hallmark. Very stable under high-volume usage.\n(Technogym-US-Dealer-Feedback)",
      "C09": "Adjustment mechanisms allow fine-tuning for different heights and limb lengths. Movement path is highly ergonomic, though adjustment options may feel more complex for novice users compared to Axiom.\n(Technogym-Training-Guides; PTA-Global-TrainingVideo)",
      "C10": "Strong in regions with Technogym presence; outside those areas, parts often ship from Europe, increasing lead times. Service coverage is improving in major U.S. cities but remains below domestic brands.\n(Technogym-US-Service-Info)",
      "C11": "Sleek, modern, premium styling with strong visual appeal. Often seen in high-end clubs, boutique studios, and luxury residential gyms.\n(Technogym-Commercial-Photos)",
      "C14": "1:1 selectorized",
      "C15": "59 x 47 x 57"
    },
    {
      "vendorid": "V04",
      "equipmentid": "E03",
      "brandid": "B05",
      "vendor": "Technogym",
      "equipment": "Chest Press",
      "brand": "Technogym",
      "model": "Selection 700",
      "qty": 1,
      "baseUnitPrice": 5000.8,
      "allInUnitPrice": 6576.904418898874,
      "overallScore": 8.288863613402723,
      "url": "https://www.technogym.com/en-US/product/selection-700-chest-press_MNFC.html",
      "S01": 9,
      "S02": 8.125,
      "S03": 5.7562531520887426,
      "S04": 7.5,
      "S05": 10,
      "S06": 10,
      "S07": 9.5,
      "S08": 7,
      "S09": 4.361904761904762,
      "S10": 9.71264367816092,
      "S11": 9.688581314878892,
      "S12": 8.288863613402723,
      "C02": 2088,
      "C03": 560,
      "C04": "Premium European construction with a heavy-duty frame, enclosed stack, and highly refined movement arms. Biomechanics are carefully engineered, giving an exceptionally smooth and precise press path. Upholstery, plastics, and adjustment mechanisms all feel upscale and tight-tolerance. Overall build quality is among the highest in the commercial chest press category.",
      "C05": 198,
      "C06": "5/2/1",
      "C07": "Designed for continuous use in high-end club and boutique environments. Structural components, bearings, and linkage systems hold up very well under heavy daily traffic when maintained properly. Upholstery and finishes also age gracefully, retaining a premium feel longer than many domestic competitors. Durability is excellent, with the main caveat being longer lead times for some replacement parts in North America.",
      "C08": "Mechanical reliability is outstanding, with very few recurring issues reported in press arms, pivots, or stack assemblies. When problems do occur, they are typically isolated and tied to long-term wear rather than design flaws. In U.S. installations, extended downtime is more likely to come from parts logistics than from frequent failures. Overall, the machine is highly reliable once installed and maintained.",
      "C09": "Seat and back adjustments offer fine-tuning for different torso lengths and shoulder structures, producing a very ergonomic press position. The motion path feels natural and joint-friendly for most users, though the range of adjustments may feel slightly complex to completely untrained exercisers. Handles and start positions are well thought out, providing smooth engagement and exit from the movement. For guided or semi-supervised environments, ease of use is excellent.",
      "C10": "Service support is strong in regions where Technogym has a direct presence and established dealer network. In other areas, parts often ship from Europe, which can extend repair times compared to domestic brands. Technicians familiar with Technogym generally rate the equipment as straightforward to service once parts are on hand. Overall support is good but not as immediate as Life Fitness or Precor in all U.S. markets.",
      "C11": "Sleek, sculpted design with premium finishes and distinctive European styling. The Selection 700 chest press often serves as a visual centerpiece in luxury gyms, boutique studios, and high-end residential facilities. Color palette, shrouds, and branding all reinforce a high-luxury impression. It clearly reads as a premium, architectural piece of equipment.",
      "C14": "1:1 selectorized",
      "C15": "36 x 58 x 67"
    },
    {
      "vendorid": "V04",
      "equipmentid": "E04",
      "brandid": "B05",
      "vendor": "Technogym",
      "equipment": "Treadmill",
      "brand": "Technogym",
      "model": "Run Connect P300",
      "qty": 2,
      "baseUnitPrice": 7037.6,
      "allInUnitPrice": 8751.904967954004,
      "overallScore": 8.021247625686668,
      "url": "https://www.technogym.com/en-US/product/excite-run_DFKU-SLS.html",
      "S01": 8,
      "S02": 7.083333333333333,
      "S03": 5.295433047087514,
      "S04": 7.5,
      "S05": 10,
      "S06": 10,
      "S07": 9.5,
      "S08": 7,
      "S09": 5.695238095238095,
      "S10": 10,
      "S11": 8.936708860759493,
      "S12": 8.021247625686668,
      "C02": 2484,
      "C03": 353,
      "C04": "Premium European construction with a highly refined frame, deck, and drive system. One of the most visually premium treadmills in the light commercial category. Extremely smooth belt action and excellent shock absorption.\n(Sources: Technogym-Run-ProductPage; European-Dealer-Listings)",
      "C05": 12,
      "C06": "5/2/2",
      "C07": "Designed for high-use club environments. Deck, belt, and drive components are engineered for long service life. However, some components have longer lead times in North America due to overseas sourcing.\n(Sources: Technogym-Commercial-Sales-Materials; Refinisher-Feedback)",
      "C08": "Mechanically stable with very few reported failures, but U.S. operators sometimes experience longer downtimes due to imported parts or limited distributor coverage.\n(Sources: Technician-Reports; U.S.-Technogym-DealerFeedback)",
      "C09": "Highly refined console (P300), though interface complexity is higher than Precor or Matrix. Step-up height (12\") is noticeably higher, making it slightly less accessible for older adults.\n(Sources: Technogym-Run-UserGuides)",
      "C10": "Strong service presence in markets where Technogym operates directly; weaker coverage elsewhere. Parts often ship from Europe, extending repair times.\n(Sources: Technogym-US-ServiceInfo)",
      "C11": "The most visually striking treadmill in this set. Sleek curves, premium materials, and modern European industrial design. Often used as a showpiece in luxury gyms and boutique hotels.\n(Sources: Technogym-Commercial-Photos)",
      "C14": 350,
      "C15": "69 x 36 x 62"
    },
    {
      "vendorid": "V04",
      "equipmentid": "E05",
      "brandid": "B05",
      "vendor": "Technogym",
      "equipment": "Elliptical",
      "brand": "Technogym",
      "model": "Synchro Connect P300",
      "qty": 2,
      "baseUnitPrice": 6543.6,
      "allInUnitPrice": 8128.019042703452,
      "overallScore": 8.208472753312032,
      "url": "https://www.technogym.com/en-US/product/excite-synchro_DFHU-SLS.html",
      "S01": 8,
      "S02": 8.444444444444445,
      "S03": 5.302353078387765,
      "S04": 7.5,
      "S05": 10,
      "S06": 10,
      "S07": 9,
      "S08": 7,
      "S09": 7.0285714285714285,
      "S10": 9.376744186046512,
      "S11": 9.970238095238095,
      "S12": 8.208472753312032,
      "C02": 2150,
      "C03": 335,
      "C04": "Premium European construction with advanced biomechanics and highly refined movement. Heavy-duty frame, enclosed drive system, and sculpted pedal arms deliver one of the smoothest elliptical motions in the commercial segment.\n(SSources: Technogym-Synchro-ProductPage; EU-Dealer-Listings)",
      "C05": 9,
      "C06": "5/2/2",
      "C07": "Engineered for heavy club use. Components—bearings, pedals, drive belts—show long lifespans under continuous use. Only limitation in the U.S. is parts availability for certain components.\n(Sources: Technogym-Commercial-Sales-Materials; Refinisher-Feedback)",
      "C08": "Mechanically outstanding with very few reported failures. Electronics are stable but may experience longer downtimes due to lead times on replacement parts.\n(Sources: Technician-Reports; U.S.-Technogym-DealerFeedback)",
      "C09": "Stride length is longest in the group (21”), enhancing comfort for taller users. Step-up height (9”) is moderate. P300 console offers advanced features but may be more complex for casual users.\n(Sources: Technogym-Synchro-User-Guides)",
      "C10": "Strong support in markets where Technogym operates directly. In other regions, parts may ship from Europe, extending repair times.\n(Sources: Technogym-US-ServiceInfo)",
      "C11": "One of the most visually premium elliptical designs available. Smooth curves, sculpted components, and high-end finish make it a centerpiece in luxury facilities.\n(Sources: Technogym-Commercial-Photos)",
      "C14": 21,
      "C15": "86 x 25 x 66"
    },
    {
      "vendorid": "V04",
      "equipmentid": "E06",
      "brandid": "B05",
      "vendor": "Technogym",
      "equipment": "Recumbent Bike",
      "brand": "Technogym",
      "model": "Excite Live Connect 300",
      "qty": 1,
      "baseUnitPrice": 4104,
      "allInUnitPrice": 5039.730698408062,
      "overallScore": 8.266394884721139,
      "url": "https://www.technogym.com/en-US/product/excite-recline_DFDU-SLS.html",
      "S01": 9,
      "S02": 8.25,
      "S03": 6.059424284121756,
      "S04": 7.5,
      "S05": 10,
      "S06": 10,
      "S07": 9.5,
      "S08": 7,
      "S09": 7.0285714285714285,
      "S10": 5.788461538461539,
      "S11": 8.34123222748815,
      "S12": 8.266394884721139,
      "C02": 1560,
      "C03": 176,
      "C04": "Premium European construction with high-end frame welding, enclosed drive components, and refined seat and backrest sculpting. The movement mechanics are smooth and highly polished, and materials feel more upscale than domestic competitors. The Excite Live line is positioned as a premium commercial product suitable for boutique and luxury facilities.\n(Sources: Technogym-Excite-ProductPage; EU-Dealer-Listings; Boutique-Studio-Equipment-Reviews)",
      "C05": "Open frame design with generous walk-through space and supportive side handles. Seat slides far forward, making entry very easy for older adults and limited-mobility users. The seating geometry is comfortable and ergonomic, though the more stylized frame may feel slightly less open than simpler domestic designs.\n(Sources: Technogym-Excite-UserGuides; Senior-Fitness-Operator-Feedback)",
      "C06": "5/2/2",
      "C07": "Engineered for high-volume commercial environments with durable bearings, belt drive components, and structural elements. Long-term durability is excellent, though some replacement parts may require longer lead times in North America due to European sourcing.\n(Sources: Technogym-Commercial-Sales-Materials; Refinisher-Feedback)",
      "C08": "Mechanical reliability is outstanding, with very few reported failures in pedal assemblies, belt drives, or seat mechanisms. Electronics are stable but may result in longer downtimes when components must be shipped from Europe or obtained through limited U.S. distributors.\n(Sources: Technician-Reports; U.S.-Technogym-DealerFeedback)",
      "C09": "Console interface is polished and feature-rich, with advanced functions that may be more complex for casual users. Step-through access is strong, and ergonomic seat design enhances comfort during longer sessions. For basic operation, controls are clear, but the richness of options can overwhelm some users.\n(Sources: Technogym-Excite-UserGuides; Boutique-Fitness-Operator-Comments)",
      "C10": "Service availability is excellent in regions where Technogym operates directly but more limited elsewhere in the U.S. Parts often ship from Europe, which can extend repair timelines compared to domestic brands.\n(Sources: Technogym-US-ServiceInfo; U.S.-Technogym-Distributors)",
      "C11": "One of the most visually premium recumbent bikes in the commercial segment, with sculpted lines, enclosed shrouds, and a sleek European industrial design. Frequently selected for luxury hotels, boutique studios, and high-end residential buildings as a visual centerpiece.\n(Sources: Technogym-Commercial-Photos; Boutique-Studio-Installations)",
      "C14": 485,
      "C15": "65 x 24 x 52"
    },
    {
      "vendorid": "V04",
      "equipmentid": "E07",
      "brandid": "B05",
      "vendor": "Technogym",
      "equipment": "Rower",
      "brand": "Technogym",
      "model": "Skillrow 7\"",
      "qty": 1,
      "baseUnitPrice": 3214.8,
      "allInUnitPrice": 4363.380021313701,
      "overallScore": 7.9096133369896595,
      "url": "https://www.technogym.com/en-US/product/skillrow_DJR0NDT.html",
      "S01": 9,
      "S02": 8,
      "S03": 2.9461825701519313,
      "S04": 7.5,
      "S05": 10,
      "S06": 10,
      "S07": 9.5,
      "S08": 7,
      "S09": 7.238095238095238,
      "S10": 6.283333333333333,
      "S11": 10,
      "S12": 7.9096133369896595,
      "C02": 2400,
      "C03": 134,
      "C04": "Premium welded steel construction with advanced biomechanics, hybrid resistance (air + magnetic), and a highly refined monorail and seat system. Materials and movement quality are among the highest available in commercial rowers. Considered one of the most premium rowers on the market.\n(Sources: Technogym-Skillrow-ProductPage; EU-Dealer-Listings; Boutique-Studio-Equipment-Reviews)",
      "C05": "Seat height is moderate and easier to mount than Concept2 but not as elevated as Xebex. Frame styling is sculpted and sleek but slightly enclosed near the rear stabilizer, which can make mounting feel less open for seniors. Handle reach and footplate height are comfortable, and forward seat travel is smooth. Good accessibility overall but not top of group.\n(Sources: Technogym-Skillrow-UserGuides; Senior-Fitness-Operator-Feedback)",
      "C06": "2/2/2",
      "C07": "Engineered for continuous high-volume use with strong track records in performance studios. Hybrid resistance system components show long lifespan, though magnetic elements may require specialized service. Structural durability is excellent.\n(Sources: Technogym-Commercial-Sales-Materials; Refinisher-Feedback)",
      "C08": "Mechanical reliability is strong, with issues typically limited to console electronics or hybrid resistance calibration. U.S. operators occasionally report longer downtime due to parts shipping from Europe. Overall performance is stable and smooth.\n(Sources: Technician-Reports; U.S.-Technogym-DealerFeedback)",
      "C09": "Highly refined stroke feel and premium handle ergonomics. However, console navigation (7” version) is more complex than Concept2 or Xebex. Requires brief learning for first-time users but offers excellent performance feedback for intermediate and advanced users.\n(Sources: Technogym-Skillrow-User-Guides; Boutique-Studio-Feedback)",
      "C10": "Service / Parts Availability\n\nStrong support in regions with direct Technogym presence; weaker elsewhere. Electronic and magnetic components can require longer lead times. Better coverage than early years but still below Life Fitness and Concept2.\n(Sources: Technogym-US-ServiceInfo; Dealer-Parts-Availability)",
      "C11": "One of the most visually striking rowers on the market, with sculpted lines, enclosed housings, and a premium finish. Frequently selected for boutique hotels and luxury training studios as a showpiece product.\n(Sources: Technogym-Commercial-Photos; Boutique-Studio-Installations)",
      "C14": 353,
      "C15": "96 x 25 x 50"
    },
    {
      "vendorid": "V04",
      "equipmentid": "E08",
      "brandid": "B05",
      "vendor": "Technogym",
      "equipment": "Bench",
      "brand": "Technogym",
      "model": "Adjustable",
      "qty": 1,
      "baseUnitPrice": 1360,
      "allInUnitPrice": 1957.959125820404,
      "overallScore": 8.099056779062805,
      "url": "https://www.technogym.com/en-US/product/adjustable-bench_PA04.html",
      "S01": 8,
      "S02": 8,
      "S03": 4.677389535163325,
      "S04": 7.5,
      "S05": 10,
      "S06": 10,
      "S07": 9,
      "S08": 7,
      "S09": 7.0285714285714285,
      "S10": 10,
      "S11": 9.634146341463413,
      "S12": 8.099056779062805,
      "C02": 1269,
      "C03": 79,
      "C04": "Premium European construction with extremely refined welds, sculpted padding, and high-end adjustment components. Movement quality feels superior, and materials are noticeably upscale. Typically used in boutique studios and luxury hospitality facilities.\n(Sources: Technogym-Adjustable-Bench-ProductPage; EU-Dealer-Listings; Luxury-Hotel-Fitness-Reviews)",
      "C05": "Despite weighing 79 lbs, the bench feels heavier when rolling because the transport handle is positioned lower and requires a deeper bend to lift. Wheels are smooth but smaller than those on Life Fitness models, which can reduce ease of movement on thicker flooring. Mobility is acceptable, but less convenient than Life Fitness and Matrix due to the handle geometry and wheel size.\n(Sources: Technogym-US-DealerFeedback; Boutique-Studio-Operator-Comments)",
      "C06": "5/2/2",
      "C07": "Engineered for heavy daily training environments. Padding, frame, and ladder mechanisms withstand intense usage. Little structural degradation over time.\n(Sources: Technogym-Commercial-Sales-Materials; Refurbisher-Feedback)",
      "C08": "Highly reliable—few moving parts and excellent manufacturing tolerances. Failures are rare but specialty parts may require European sourcing, increasing downtime.\n(Sources: Technician-Reports; U.S.-Technogym-DealerFeedback)",
      "C09": "Premium design with very smooth back pad adjustments and refined locking positions. Padding is highly contoured and comfortable, offering excellent support during incline and flat movements. Bench height is slightly higher than average, which can aid mounting for stronger users but may be less optimal for shorter or older adults. Overall ergonomics, finish, and adjustment quality are superior and align with Technogym’s reputation for polished, premium equipment.\n(Sources: Technogym-AdjustableBench-ProductPage; EU-Dealer-Listings; Boutique-Studio-Equipment-Reviews)",
      "C10": "Excellent in regions where Technogym operates directly but more limited elsewhere. Replacement pads and hardware are available but may take longer to ship due to EU sourcing.\n(Sources: Technogym-US-ServiceInfo; Dealer-Parts-Availability)",
      "C11": "One of the most visually striking benches on the market, with sculpted pads and refined frame geometry. Often chosen as a design centerpiece in luxury gyms.\n(Sources: Technogym-Commercial-Photos; Boutique-Studio-Installations)",
      "C14": 330,
      "C15": "47 x 27 x 52"
    },
    {
      "vendorid": "V05",
      "equipmentid": "E01",
      "brandid": "B06",
      "vendor": "Top Fitness",
      "equipment": "Dual Pulley",
      "brand": "True",
      "model": "Inspire FT2 Pro",
      "qty": 1,
      "baseUnitPrice": 5800,
      "allInUnitPrice": 7552.458111512367,
      "overallScore": 6.790272805671226,
      "url": "",
      "S01": 7,
      "S02": 7.5,
      "S03": 7.0021515985061145,
      "S04": 6,
      "S05": 7,
      "S06": 7,
      "S07": 7,
      "S08": 6.5,
      "S09": 3.1333333333333333,
      "S10": 7.585877862595421,
      "S11": 9.905405405405405,
      "S12": 6.790272805671226,
      "C02": 3353.6,
      "C03": 879.6,
      "C04": "Commercial-grade hybrid functional trainer with integrated smith mechanism and dual weight stacks. The FT2 Pro uses a steel frame with a compact footprint and enclosed stack design, though overall refinement is lower than Life Fitness or Technogym units. Pulley travel is smooth but lighter in feel compared to Precor and Matrix commercial cable systems. Plastics and shrouding are functional but not premium. While sturdy for light-commercial environments, the design is primarily home-use oriented and lacks the heavy overbuilt construction typical of dedicated commercial DAP units.  However, this is to some degree offset by it's greater versatility compared to the other machines being considered.  In addition to its core pulley system, the FT2 Pro integrates a full Smith mechanism and supplemental rear cable pulley, offering a broader exercise library than standard dual pulleys. \n(Sources: True-Inspire-FT2Pro-ProductPage; Dealer-TopFitness-FT2Pro-Listings; User-Refurbisher-Reviews)",
      "C05": 165,
      "C06": "10/1/0.25",
      "C07": "Durability is acceptable for light-traffic environments but noticeably below true commercial cable systems. Guide rods, pulley housings, and bearings show moderate wear in multi-user settings. The integrated smith carriage introduces additional friction points not seen in dedicated DAP units. Refurbishers report that FT2 machines from apartment gyms often exhibit faster cosmetic and mechanical wear than comparable Matrix or Life Fitness trainers.\n(Sources: Refurbished-Gym-Equipment-Reports; Technician-Feedback-FT2-Series; Apartment-Gym-Operator-Reviews)",
      "C08": "Reliability is fair but not on par with the 4 established commercial brands. Cable stretch, pulley wear, and smith carriage alignment are commonly cited maintenance points in facilities with repeated daily use. Electronics and selector mechanisms remain generally stable, but the machine is not engineered for constant use by multiple users each day. Reliability is best classified as “light-commercial acceptable but not optimized.”\n(Sources: Inspire-FT2-User-Forums; Technician-Service-Logs; Dealer-Repair-Notes)",
      "C09": "The FT2 Pro offers a wide range of functions — dual adjustable pulleys, smith bar, accessory attachments — but this versatility comes with increased complexity. Adjustment levers are accessible, but the multi-mode configuration is less intuitive for older or inexperienced users than Precor or Matrix DAP units. Resistance path is smooth but lighter in commercial applications. Instructional labeling is adequate but not as clear as Life Fitness or Technogym.\n(Sources: Inspire-FT2Pro-UserManual; TopFitness-CustomerFeedback; MultiHousing-Gym-Operator-Comments)",
      "C10": "Parts availability is good for home fitness channels and Top Fitness distribution, but commercial service networks carry fewer Inspire components compared to Precor, Life Fitness, or Matrix. Technicians report longer delays for smith-carriage components and cables. The smaller commercial footprint limits same-day or next-day technician dispatch options in many U.S. cities.\n(Sources: Service-Technician-Reports; Dealer-Parts-Listings; Inspire-Fitness-Distributor-Feedback)",
      "C11": "Attractive, modern appearance with enclosed stacks and integrated smith bar. The FT2 Pro has a sleek consumer-grade aesthetic, but lacks the sculpted, premium look of Technogym or the polished commercial styling of Life Fitness. Overall, it appears more “high-end home gym” than “commercial facility centerpiece.”\n(Sources: TopFitness-ProductPhotos; Boutique-HomeGym-Installations)",
      "C14": "2:1 ratio",
      "C15": "64 x 52.4 x 83.2"
    },
    {
      "vendorid": "V05",
      "equipmentid": "E02",
      "brandid": "B06",
      "vendor": "Top Fitness",
      "equipment": "Leg Ext/Curl",
      "brand": "True",
      "model": "Force SD1000",
      "qty": 1,
      "baseUnitPrice": 3599,
      "allInUnitPrice": 4606.732969999678,
      "overallScore": 7.605152707854127,
      "url": "https://www.topfitness.com/products/true-force-leg-extension-leg-curl-sd1000",
      "S01": 7.25,
      "S02": 7.173780487804878,
      "S03": 9.575402431445792,
      "S04": 6,
      "S05": 7.5,
      "S06": 7.75,
      "S07": 7.33,
      "S08": 8,
      "S09": 7.333333333333333,
      "S10": 9.22654462242563,
      "S11": 8.078125,
      "S12": 7.605152707854127,
      "C02": 2731.25,
      "C03": 517,
      "C04": "Solid light-commercial welded steel frame with a compact footprint and straightforward mechanical design. Pad upholstery and stitching are durable for moderate-use installations, though refinement and sculpting are below Life Fitness and Technogym. Cam and linkage movement is generally smooth, and adjustment levers have a basic but functional feel. Overall construction is appropriate for hotel gyms, PT studios, and multi-housing fitness rooms but not engineered to the heavy-duty standard of full commercial lines.\n(Sources: True-Force-SD1000-ProductPage; Dealer-LightCommercial-Listings; PT-Studio-Operator-Feedback)",
      "C05": 175,
      "C06": "10/5/1",
      "C07": "Well-suited for moderate-volume environments such as apartments, hotel gyms, and small studios. Frame integrity and pivot points hold up well under typical usage. Wear items include upholstery, bushings, and cables, which follow normal service intervals. Not designed for continuous club-level traffic but performs reliably in light-commercial settings.\n(Sources: Refurbisher-True-Force-Series-Notes; Technician-Feedback; Multi-Housing-Fitness-Installer-Reports)",
      "C08": "Mechanical reliability is strong given the simple cam and cable layout. Adjustment mechanisms remain stable over time, and cable tracking is consistent with routine maintenance. Failures are infrequent and typically limited to pads or cable wear. Slightly below Precor and Matrix in long-term precision of movement arms but predictable overall.\n(Sources: Fitness-Technician-Reports; Dealer-Service-Logs; LightCommercial-Gym-Operator-Reviews)",
      "C09": "Adjustment levers are accessible and color-indicated, and switching between extension and curl is straightforward. Seat pad, back pad, and leg rollers provide adequate support, though ergonomics are less sculpted than higher-end units. Motion path is intuitive for most users, including older adults. Lacks the premium refinement and micro-adjustability found in Technogym or Life Fitness but remains user-friendly for general fitness populations.\n(Sources: True-Force-SD1000-UserGuide; Dealer-Demo-Feedback; Hotel-Fitness-Operator-Comments)",
      "C10": "True has a stable U.S. distribution network, and replacement pads, cables, and hardware for the Force series are generally easy to source. Response times vary by region but tend to be faster than European brands and comparable to Matrix’s mid-tier lines. Some specialty components may need to be ordered through True directly.\n(Sources: True-Fitness-US-Service-Info; Commercial-Technician-Reviews; Dealer-Parts-Listings)",
      "C11": "Functional, compact design with clean frame geometry and straightforward pad styling. Less sculpted and less visually premium than Technogym or Life Fitness but appropriate for multi-housing settings. Presents a clean, professional look without high-end detailing.",
      "C14": "1:1 selectorized",
      "C15": "57.5 x 47.5 x 57"
    },
    {
      "vendorid": "V05",
      "equipmentid": "E03",
      "brandid": "B06",
      "vendor": "Top Fitness",
      "equipment": "Chest Press",
      "brand": "True",
      "model": "Force Multi-Press SD1005",
      "qty": 1,
      "baseUnitPrice": 3899,
      "allInUnitPrice": 4931.482969999678,
      "overallScore": 6.495112296723082,
      "url": "https://www.topfitness.com/products/copy-of-true-force-ab-back-machine-sd1004?_pos=1&_sid=40d011870&_ss=r",
      "S01": 6,
      "S02": 7.145833333333333,
      "S03": 7.6768645501934065,
      "S04": 6,
      "S05": 6,
      "S06": 6,
      "S07": 6,
      "S08": 7,
      "S09": 7.333333333333333,
      "S10": 5.563786008230452,
      "S11": 9.86159169550173,
      "S12": 6.495112296723082,
      "C02": 3645,
      "C03": 570,
      "C04": "Light-commercial welded steel frame with a compact footprint and multi-position press arms that allow flat and incline variations. The construction feels solid for moderate-traffic environments, though not as overbuilt as full commercial chest presses. Upholstery and pads are durable but less sculpted and refined than higher-end Life Fitness or Technogym units. Overall build is appropriate for HOAs, small hotels, and training studios rather than heavy club floors.",
      "C05": 175,
      "C06": "10/5/1",
      "C07": "Durability is good for light-commercial settings where daily usage is steady but not continuous. Frame, movement arms, and pivot points hold up well with regular preventive maintenance. Wear items such as pads, bushings, and grips will show aging sooner than top-tier commercial lines but follow predictable replacement patterns. For condo and small-facility use, long-term durability is acceptable.",
      "C08": "Mechanical layout is straightforward, which supports generally reliable operation over time. Most service needs involve standard cable, bushing, or upholstery replacement rather than structural or design-related failures. Compared with the four established commercial brands, reliability is adequate but not as thoroughly proven in high-volume environments. For the intended light-commercial level, it performs reliably when maintained.",
      "C09": "Seat and back adjustments are functional, but the multi-press configuration introduces more setup choices than a single fixed-path chest press. Users comfortable with strength equipment will appreciate the versatility; beginners and older adults may need brief guidance on selecting angles and starting positions. Once set, the press path is stable and comfortable for general chest training. Overall ease of use is good, but slightly less intuitive than simpler single-function machines.",
      "C10": "True maintains a stable U.S. service and parts network, though coverage is not as dense as Life Fitness or Precor. Common replacement items—pads, cables, grips, and hardware—are available through domestic distributors and Top Fitness channels. Some specialty parts may require ordering directly from True, adding some lead time. For HOA and light-commercial facilities, service and parts access are generally adequate.",
      "C11": "Compact, functional design with a modern light-commercial appearance. The machine looks more “high-end home/commercial hybrid” than centerpiece club equipment, with simpler lines and less sculpting than Technogym or premium Life Fitness pieces. It presents well in smaller gyms that prioritize versatility and value over luxury styling. Overall, it reads as clean and contemporary without being visually dominant.",
      "C14": "1:1 selectorized",
      "C15": "60.75 x 60 x 59.75"
    },
    {
      "vendorid": "V05",
      "equipmentid": "E04",
      "brandid": "B06",
      "vendor": "Top Fitness",
      "equipment": "Treadmill",
      "brand": "True",
      "model": "True Gravity Unite LED",
      "qty": 2,
      "baseUnitPrice": 6699,
      "allInUnitPrice": 7965.855983310287,
      "overallScore": 7.857878538432464,
      "url": "https://www.topfitness.com/collections/commercial-treadmills/products/true-gravity-treadmill",
      "S01": 8.5,
      "S02": 9.5,
      "S03": 5.817971965520504,
      "S04": 6,
      "S05": 8,
      "S06": 8.25,
      "S07": 7.75,
      "S08": 8.5,
      "S09": 7.333333333333333,
      "S10": 9.52819332566168,
      "S11": 9.164556962025316,
      "S12": 7.857878538432464,
      "C02": 2607,
      "C03": 362,
      "C04": "Light-commercial welded steel construction with a compact frame and straightforward deck structure. Belt and roller components are solid for the mid-tier commercial category, though not as refined as Technogym or Life Fitness. Shock absorption system is adequate for general fitness environments, providing moderate cushioning without advanced technologies like Precor’s Ground Effects® or Life Fitness FlexDeck®. Overall construction is appropriate for condominium gyms, small hotels, and multi-housing fitness rooms, but not engineered to endure the continuous, high-volume usage expected in full commercial health clubs.\n(Sources: True-Gravity-Unite-ProductPage; Dealer-LightCommercial-Treadmill-Listings; Multi-Housing-Fitness-Operator-Feedback)",
      "C05": 6.5,
      "C06": "7/5/1",
      "C07": "Durability is strong for moderate-use settings such as apartments, hotel fitness rooms, and small studios. Deck and belt components maintain integrity under typical daily traffic, and internal drive components show good consistency with routine preventive maintenance. However, the machine is not designed for the sustained high workloads seen in large commercial clubs, and long-term belt/deck longevity may trail Life Fitness and Technogym.\n(Sources: Technician-Reports; Commercial-Installer-Feedback; True-Fitness-LightCommercial-SupportNotes)",
      "C08": "Mechanical reliability is solid with a straightforward drive system and fewer electronic complexities than immersive consoles. Lift motor and control board performance is stable in light-commercial environments. Reported issues typically involve belt tracking or occasional sensor replacement. Reliability is good overall, positioned slightly below Life Fitness and Matrix but above budget commercial models.\n(Sources: Dealer-Service-Logs; Fitness-Equipment-Technician-Reports; LightCommercial-Gym-Operator-Feedback",
      "C09": "LED console provides a simple, no-frills interface that is easier for older adults than touchscreen consoles. Quick-start operation and tactile keys are intuitive. Step-up height of 6.5’’ is among the lowest in this comparison, improving accessibility for seniors and deconditioned users. Handrail placement and deck width support comfortable walking and jogging. Lacks the advanced programmability or coaching features found on premium machines but is very user-friendly for general fitness needs.\n(Sources: True-Gravity-User-Guides; Senior-Fitness-Operator-Feedback; Dealer-Demo-Notes)",
      "C10": "True maintains a stable U.S. service network with generally reliable parts availability, particularly across the Force and Gravity series. Replacement belts, decks, rollers, and electronics are readily sourced through domestic distributors. Service coverage is not as dense as Life Fitness, but turnaround times are typically faster than European brands.\n(Sources: True-Fitness-US-Service-Info; Dealer-Parts-Listings; Commercial-Technician-Reviews)",
      "C11": "Modern, compact design with clean lines and a utilitarian LED console. Less sculpted and premium than Technogym or Life Fitness but blends well in small commercial environments. Suitable for hotel and condominium gyms seeking a clean, professional look without high-end visual presence.\n(Sources: True-Commercial-Photos; Boutique-Fitness-Installations)",
      "C14": 400,
      "C15": "79 x 33 x 60"
    },
    {
      "vendorid": "V05",
      "equipmentid": "E05",
      "brandid": "B06",
      "vendor": "Top Fitness",
      "equipment": "Elliptical",
      "brand": "True",
      "model": "True Gravity Unite LED",
      "qty": 2,
      "baseUnitPrice": 5899,
      "allInUnitPrice": 6974.770267361122,
      "overallScore": 8.123988969073883,
      "url": "https://www.topfitness.com/collections/commercial-ellipticals/products/true-gravity-elliptical",
      "S01": 8.25,
      "S02": 9.375,
      "S03": 6.17907474228235,
      "S04": 6,
      "S05": 8.5,
      "S06": 8.5,
      "S07": 8.25,
      "S08": 8,
      "S09": 10,
      "S10": 10,
      "S11": 10,
      "S12": 8.123988969073883,
      "C02": 2016,
      "C03": 336,
      "C04": "Commercial-grade welded steel frame with a compact center-drive layout and enclosed drive system. Foot platforms and arms feel solid under load, and the 336-lb unit weight gives it good stability without feeling bulky. Fit and finish are more refined than Matrix but not as premium as Technogym’s sculpted designs. Overall construction is well-suited to condo gyms, hotels, and light-commercial facilities that don’t see heavy club traffic.\n(Sources: True-Gravity-Elliptical-ProductPage; TopFitness-Dealer-Notes; LightCommercial-Gym-Operator-Feedback)",
      "C05": 8,
      "C06": "7/5/2",
      "C07": "Engineered for light-commercial use with a robust frame, sealed bearings, and a self-generating brake system designed for regular daily traffic. Wear items (pivot bushings, pedals, and grips) show predictable replacement intervals in multi-unit facilities. Not as overbuilt as full club lines, but durability is competitive with Matrix and slightly below the most premium European units.\n(Sources: True-Commercial-Cardio-Brochure; Refurbisher-True-Gravity-Series-Notes; Technician-Reports)",
      "C08": "The self-powered drive and braking system provide consistent resistance with few chronic issues reported in light-commercial settings. Electronics and LED console are simpler than full touchscreen systems, which helps reduce failure points. Most service events relate to normal wear components rather than systemic mechanical problems.\n(Sources: Fitness-Technician-Feedback; Dealer-Service-Logs; LightCommercial-Facility-Operator-Comments)",
      "C09": "Low 8” step-up height and a 21” stride make the unit approachable for a broad range of users, including older adults. The LED console offers clear readouts and straightforward program selection, though the expanded workout options are slightly more complex than basic hotel-style panels. Overall, most users can start and adjust workouts quickly once shown the basics.\n(Sources: True-Gravity-Elliptical-UserGuide; Hospitality-Fitness-Operator-Feedback; Dealer-Demo-Notes)",
      "C10": "True has a solid U.S. presence with established commercial distributors, and parts for the Gravity series—pedals, grips, bearings, and electronics—are generally straightforward to obtain. Coverage is not as dense as Life Fitness, but response times and part availability are typically comparable to Matrix in major metro areas.\n(Sources: True-Fitness-US-Service-Info; Commercial-Technician-Reviews; Dealer-Parts-Listings)",
      "C11": "Compact, center-drive profile with clean lines and a modern shroud design. Visually more refined than basic Precor and Matrix units, though not as striking as Technogym’s flagship ellipticals. Presents as a contemporary, professional piece that fits well in upgraded condo and hotel gyms.\n(Sources: True-Gravity-Elliptical-ProductPhotos; Boutique-Hotel-Gym-Installations)",
      "C14": 21,
      "C15": "63 x 32 x 64"
    },
    {
      "vendorid": "V05",
      "equipmentid": "E06",
      "brandid": "B06",
      "vendor": "Top Fitness",
      "equipment": "Recumbent Bike",
      "brand": "True",
      "model": "True Launch Unite LED",
      "qty": 1,
      "baseUnitPrice": 3399,
      "allInUnitPrice": 4145.406993713387,
      "overallScore": 7.4585889558993825,
      "url": "https://www.topfitness.com/collections/commercial-bikes/products/true-launch-recumbent-bike",
      "S01": 7.75,
      "S02": 8.875,
      "S03": 7.366675123981588,
      "S04": 6,
      "S05": 8,
      "S06": 7,
      "S07": 7.5,
      "S08": 8,
      "S09": 8,
      "S10": 4.777777777777778,
      "S11": 7.819905213270141,
      "S12": 7.4585889558993825,
      "C02": 1890,
      "C03": 165,
      "C04": "Solid light-commercial welded steel frame with a compact drive system and straightforward seat rail assembly. The construction quality is appropriate for moderate-traffic environments such as apartment gyms, hotels, and small PT studios. Upholstery, plastics, and crank components are durable but not as refined or sculpted as Life Fitness or Technogym. Movement mechanics are smooth and stable, and adjustment levers have a functional feel consistent with other True light-commercial units. Overall, the build is reliable for HOAs and hospitality settings but does not match the premium engineering of high-end European models.\n(Sources: True-Launch-Recumbent-ProductPage; Dealer-LightCommercial-Listings; Commercial-Installer-Feedback)",
      "C05": "Wide, open step-thru frame with unobstructed entry from either side. The seat slides forward far enough to reduce hip flexion demands, making it accessible for older adults or users with limited mobility. The standover height is low, and side handles provide stable support when mounting or dismounting. The geometry is simple and more open than Matrix but slightly less refined in ergonomics compared to Life Fitness.\n(Sources: True-Launch-UserGuide; Senior-Fitness-Operator-Feedback; Hotel-Gym-Installer-Notes)",
      "C06": "7/5/1",
      "C07": "Performs well in moderate-use environments such as multi-housing fitness rooms and hospitality gyms. Seat rail, belt drive, and pedal assemblies maintain function with predictable wear of pads and straps. Frame integrity is strong for the category, though the unit is not designed for the heavy daily traffic of full commercial clubs. Long-term durability aligns with other True light-commercial products and is adequate for HOAs.\n(Sources: Refurbisher-True-Series-Notes; LightCommercial-Installer-Reports; Technician-Feedback)",
      "C08": "Mechanical reliability is solid due to the simple belt-drive layout and minimal electronic complexity of the LED console. Failures tend to be limited to standard wear items such as pedal straps, seat bushings, or adjustment levers. Electronics are stable with low reported failure rates; however, long-term precision of pedal mechanics trails behind Matrix and Life Fitness.\n(Sources: Fitness-Technician-Reports; Dealer-Service-Logs; LightCommercial-Operator-Feedback)",
      "C09": "LED console is straightforward, with quick-start functionality and clearly labeled controls suitable for seniors or first-time exercisers. Step-thru entry is accessible, and seat adjustments are easy to reach from a seated or standing position. Pedal straps and handlebars are functional but less ergonomically refined than higher-end units. Overall user experience is simple and intuitive for general fitness populations.\n(Sources: True-Launch-UserGuide; Hotel-Fitness-Operator-Comments; Dealer-Demo-Feedback)",
      "C10": "True maintains stable U.S. distribution and service coverage, with readily available belts, pedals, electronics, and upholstery components for the Launch series. Technician response times vary by region but are generally comparable to Matrix and faster than European brands such as Technogym. Specialty electronics or console components may need to be ordered directly from True, but common wear parts are widely stocked.\n(Sources: True-Fitness-US-Service-Info; Commercial-Technician-Reviews; Dealer-Parts-Listings)",
      "C11": "Clean, modernized appearance with simple lines and a compact profile. Not sculpted or premium to the level of Technogym or high-tier Life Fitness models, but presents well in condominium and hospitality settings. The design is functional rather than visually striking, but the dark color scheme blends easily into most fitness rooms.\n(Sources: True-Launch-ProductPhotos; Multi-Housing-Gym-Installations)",
      "C14": 400,
      "C15": "63 x 30 x 54"
    },
    {
      "vendorid": "V05",
      "equipmentid": "E07",
      "brandid": "B06",
      "vendor": "Top Fitness",
      "equipment": "Rower",
      "brand": "True",
      "model": "True Vapor Ro",
      "qty": 1,
      "baseUnitPrice": 1999,
      "allInUnitPrice": 2648.0425048737784,
      "overallScore": 7.069474842473728,
      "url": "https://www.topfitness.com/products/true-vapor-ro-rowing-machine?variant=32976983359597",
      "S01": 7.25,
      "S02": 7.875,
      "S03": 4.854647968105916,
      "S04": 6,
      "S05": 8,
      "S06": 7.75,
      "S07": 7.25,
      "S08": 7.75,
      "S09": 7.428571428571429,
      "S10": 6.684397163120568,
      "S11": 9.626865671641792,
      "S12": 7.069474842473728,
      "C02": 2256,
      "C03": 129,
      "C04": "Light-commercial welded steel frame with a compact front housing and a smooth belt-driven resistance system. Rail and seat assembly are sturdy and track cleanly, though the overall refinement and material polish fall below Life Fitness Heat Row and Technogym Skillrow. Plastics and shrouds are functional but not premium, in line with True’s other light-commercial cardio products. Suitable for apartment gyms, PT studios, and HOA facilities, but not engineered for full-club performance environments.”\n(Sources: True-VaporRo-ProductPage; Dealer-LightCommercial-Listings; Multi-Housing-Fitness-Operator-Feedback)",
      "C05": "Light-commercial welded steel frame with a compact front housing and a smooth belt-driven resistance system. Rail and seat assembly are sturdy and track cleanly, though the overall refinement and material polish fall below Life Fitness Heat Row and Technogym Skillrow. Plastics and shrouds are functional but not premium, in line with True’s other light-commercial cardio products. Suitable for apartment gyms, PT studios, and HOA facilities, but not engineered for full-club performance environments.”\n(Sources: True-VaporRo-ProductPage; Dealer-LightCommercial-Listings; Multi-Housing-Fitness-Operator-Feedback)",
      "C06": "5/3/1",
      "C07": "Durability is solid for light-commercial environments. Belt drive, seat rollers, and rail alignment hold up consistently under moderate daily use. Wear items—foot straps, rollers, and belt components—follow predictable replacement intervals. While not built for high-volume or athletic performance studios, the Vapor Ro performs reliably in multi-unit facilities, apartment gyms, and hotel fitness rooms with routine preventive maintenance.”\n(Sources: Refurbisher-True-Cardio-Notes; Technician-Reports; LightCommercial-Gym-Installer-Feedback)",
      "C08": "Mechanical layout is simple and produces few chronic issues. The belt tension system remains stable over time, and console electronics are straightforward with low failure rates. Most reliability concerns relate to routine maintenance items rather than structural defects. Overall reliability is good but slightly less proven than long-established commercial rowers such as Concept2 or Life Fitness.”\n(Sources: Dealer-Service-Logs; Fitness-Technician-Reports; Multi-Housing-Facility-Maintenance-Notes)",
      "C09": "ntuitive LED console with simple navigation and quick-start functionality. Belt resistance system delivers a predictable stroke feel that is easy for beginners to learn. Footplate adjustments are straightforward, and handle ergonomics are comfortable for general fitness users. Movement quality is smooth, though not as refined as the hybrid resistance systems on premium rowers. Overall, the Vapor Ro offers a user-friendly experience suited to multi-unit housing and hotel gyms.”\n(Sources: True-VaporRo-UserGuides; Dealer-Demo-Reviews; Corporate-Fitness-Operator-Feedback)",
      "C10": "True maintains a solid domestic parts network, with common components such as belts, rollers, foot straps, and console electronics readily available. Technician coverage is strong in most metropolitan areas, though not as dense as Life Fitness or Concept2. Specialty components may require direct ordering through True, but turnaround times are generally reasonable for light-commercial customers.”\n(Sources: True-Fitness-US-ServiceInfo; Commercial-Technician-Reviews; Dealer-Parts-Listings)",
      "C11": "Clean, modern aesthetic with a compact footprint and straightforward frame geometry. While not as visually striking as Technogym Skillrow or as sculpted as Life Fitness Heat Row, the Vapor Ro presents a professional look that fits well in hotel gyms, multi-unit housing facilities, and condominium fitness rooms. Design emphasizes function over visual impact but remains appealing and contemporary.”\n(Sources: True-VaporRo-ProductPhotos; Dealer-Showroom-Images; Hospitality-Gym-Installations)",
      "C14": 350,
      "C15": "94 x 24 x 47"
    },
    {
      "vendorid": "V05",
      "equipmentid": "E08",
      "brandid": "B06",
      "vendor": "Top Fitness",
      "equipment": "Bench",
      "brand": "True",
      "model": "True Flat/Incline/Decline XFW-7500",
      "qty": 1,
      "baseUnitPrice": 1099,
      "allInUnitPrice": 1324.1314485582916,
      "overallScore": 7.498156578532933,
      "url": "https://www.topfitness.com/collections/benches/products/true-flat-incline-decline-bench-xfw-7500",
      "S01": 8.5,
      "S02": 8.125,
      "S03": 6.916335636738506,
      "S04": 6,
      "S05": 7,
      "S06": 6.75,
      "S07": 8.25,
      "S08": 7.5,
      "S09": 8,
      "S10": 8.187096774193549,
      "S11": 9.634146341463413,
      "S12": 7.498156578532933,
      "C02": 1550,
      "C03": 79,
      "C04": "Light-commercial welded steel frame with a broad rear stabilizer and solid pad support system. Adjustment ladder and pivot points feel sturdy, though not as refined or smooth as Life Fitness or Technogym mechanisms. Padding is firm and durable, with upholstery quality that aligns with True’s light-commercial line. Overall construction is dependable for apartment gyms, HOAs, and moderate-use facilities, but lacks the premium refinement found in higher-tier benches.”\n(Sources: True-XFW7500-ProductPage; Dealer-LightCommercial-Listings; Multi-Housing-Fitness-Operator-Feedback)",
      "C05": "At 79 lbs, the XFW-7500 is manageable to move but requires modest lifting effort. Rear transport wheels are functional and roll smoothly on commercial flooring, though slightly smaller than those on Life Fitness, requiring a steeper lift angle to initiate movement. The front lifting point is a simple frame grab rather than an ergonomic transport handle, making it less convenient to maneuver frequently. Mobility is adequate for HOAs and light-commercial environments but not optimized for high-traffic relocation.”\n(Sources: True-Dealer-Mobility-Notes; Commercial-Installer-Feedback; Multi-Housing-Fitness-Operator-Comments)",
      "C06": "10/5/1",
      "C07": "Durability is solid for light-commercial applications. Frame welds hold up well under routine use, and the adjustment ladder exhibits predictable long-term performance. Wear items such as upholstery, pad edges, and foot caps may show cosmetic wear sooner than Life Fitness or Technogym, but structural integrity remains consistent. A dependable option for HOA, hotel, and apartment gyms with normal daily usage patterns.”\n(Sources: Refurbisher-True-Strength-Notes; Technician-Reports; Dealer-Resale-Data)",
      "C08": "Simple mechanical layout with few failure points. Adjustment positions lock securely and maintain alignment over time. Wheel assemblies and frame hardware demonstrate stable long-term behavior with minimal reports of mechanical faults. While not engineered for high-volume barbell clubs, the reliability profile is strong for its intended light-commercial setting.”\n(Sources: Commercial-Technician-Feedback; True-Service-Logs; LightCommercial-Gym-Maintenance-Notes)",
      "C09": "Back pad offers multiple incline and decline settings, including a true decline position, which increases exercise versatility compared to Precor, Matrix, or Life Fitness in this comparison group. Adjustment ladder operates smoothly and locks firmly, though it is less refined than premium mechanisms. Bench height is moderate and accessible to most users, and pad firmness provides stable support for pressing movements. Seat adjustment is functional but minimally sculpted. Overall, the XFW-7500 is straightforward to operate and offers a broader range of training positions than many competitors.”\n(Sources: True-XFW7500-ProductPage; Dealer-Equipment-Notes; HOA/Hotel-Fitness-Operator-Feedback)",
      "C10": "True maintains a reliable U.S. parts distribution network. Common replacement items—pads, hardware, rollers, bolts, and foot caps—are readily available through domestic dealers. Service coverage is strong in most major metro areas and typically results in reasonable turnaround times. While not as extensive as Life Fitness, parts accessibility is solid for the light-commercial category.”\n(Sources: True-US-ServiceInfo; Commercial-Technician-Reviews; Dealer-Parts-Listings)",
      "C11": "Clean and straightforward design with minimal sculpting. Industrial but contemporary appearance that blends well into hotel, condo, and HOA fitness rooms. Not as visually refined as Technogym or Life Fitness offerings but offers a professional look suitable for multipurpose gyms prioritizing function over premium presentation.”\n(Sources: True-XFW7500-ProductPhotos; Commercial-Installations; Dealer-Showroom-Images)",
      "C14": "N/A",
      "C15": "50 x 31 x 19"
    }
  ]
}